stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
/**
  ******************************************************************************
  * @file    sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
  * @brief   Sidewalk-specific GAP and GATT handling
  * 
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <stdlib.h>
#include <stdio.h>

#include "bluetooth_hci_defs.h"
#include "sid_pal_ble_adapter_stm32wba.h"
#include "sid_pal_ble_adapter_stm32wba_private_defs.h"
#include "sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.h"
#include "sid_pal_ble_adapter_stm32wba_utils.h"

/* Sidewalk interfaces */
#include <sid_pal_assert_ifc.h>
#include <sid_pal_critical_region_ifc.h>
#include <sid_pal_log_ifc.h>

/* BLE stack */
#include <ble_core.h>
#include <ble_types.h>
#include <ll_sys_if.h>

/* Platform-specific headers */
#include "app_conf.h"
#include <cmsis_os2.h>
#include "stm32_rtos.h"

/* Utilities and helpers */
#include <sid_stm32_common_utils.h>
#include <stm32_timer.h>

/* Private defines -----------------------------------------------------------*/

#define BLE_AMA_SERVICE_CHAR_COUNT                                  (2u)
#ifndef SIDEWALK_BLE_AMA_SEND_OUT_MSG_QUEUE_LEN
#  define SIDEWALK_BLE_AMA_SEND_OUT_MSG_QUEUE_LEN                   (10u) /*!< Uplink message queue size for Sidewalk-over-BLE link */
#endif /* SIDEWALK_BLE_AMA_SEND_OUT_MSG_QUEUE_LEN */

#define SID_BLE_AMAZON_COMPANY_ID                                   (0x0171u)

#define SID_BLE_SPEC_CONN_INTERVAL_MIN                              (SID_STM32_BLE_MS_TO_CONN_INTERVAL_UNITS(30u))      /*!< The absolute minimum acceptable connection interval as per Sidewalk specification */
#define SID_BLE_SPEC_CONN_INTERVAL_MAX                              (SID_STM32_BLE_MS_TO_CONN_INTERVAL_UNITS(4000u))    /*!< The absolute maximum acceptable connection interval as per Sidewalk specification */
#define SID_BLE_REASONABLE_CONN_TIMEOUT                             (SID_STM32_BLE_MS_TO_CONN_SUPERVISION_UNITS(5000u)) /*!< Some reasonable time for BLE connection timeout. This value is used only when it exceeds the bare minimum for given connection interval and latency */
#define SID_BLE_UNACCEPTABLE_CONN_PARAMS_UPDATE_LIMIT               (5u)

/* Private macro -------------------------------------------------------------*/

#ifndef SID_BLE_SIDEWALK_EXTRA_LOGGING
/* Set SID_BLE_SIDEWALK_EXTRA_LOGGING to 1 to enable extended logs */
#  define SID_BLE_SIDEWALK_EXTRA_LOGGING (0)
#endif

#if SID_BLE_SIDEWALK_EXTRA_LOGGING
#  define SID_BLE_SIDEWALK_LOG_ERROR(...)         SID_PAL_LOG_ERROR(__VA_ARGS__)
#  define SID_BLE_SIDEWALK_LOG_WARNING(...)       SID_PAL_LOG_WARNING(__VA_ARGS__)
#  define SID_BLE_SIDEWALK_LOG_INFO(...)          SID_PAL_LOG_INFO(__VA_ARGS__)
#  define SID_BLE_SIDEWALK_LOG_DEBUG(...)         SID_PAL_LOG_DEBUG(__VA_ARGS__)
#  define SID_BLE_SIDEWALK_LOG_TRACE(...)         SID_PAL_LOG_TRACE(__VA_ARGS__)
#else
#  define SID_BLE_SIDEWALK_LOG_ERROR(...)         ((void)0u)
#  define SID_BLE_SIDEWALK_LOG_WARNING(...)       ((void)0u)
#  define SID_BLE_SIDEWALK_LOG_INFO(...)          ((void)0u)
#  define SID_BLE_SIDEWALK_LOG_DEBUG(...)         ((void)0u)
#  define SID_BLE_SIDEWALK_LOG_TRACE(...)         ((void)0u)
#endif

/* Private typedef -----------------------------------------------------------*/

typedef struct {
    uint8_t * data;
    uint32_t  length;
} AMAMessageQueueElement_t;

/* Private variables ---------------------------------------------------------*/

sid_pal_ble_sidewalk_link_ctx_t sid_ble_sidewalk_ctx = {
    .conn_ctx                       = NULL,
    .ble_cfg                        = NULL,
    .adv_set = {
        .Advertising_Handle              = SID_STM32_BLE_SIDEWALK_VIRT_DEV_ID,
        .Duration                        = 0u,
        .Max_Extended_Advertising_Events = 0u,
    },
    .event_callbacks                = NULL,
    .advertising_state              = BADVS_ADVERTISEMENT_OFF,

    .ama_ctx = {
        .inbox_char_handle          = SID_STM32_BLE_HANDLE_INVALID_VALUE,
        .outbox_char_handle         = SID_STM32_BLE_HANDLE_INVALID_VALUE,
        .service_context = {
            .num_characteristics    = 0u,
            .characteristic_context = NULL,
            .service_handle         = SID_STM32_BLE_HANDLE_INVALID_VALUE,
        },
    },
};

/* Application-specific and ACI related resources */
static osThreadId_t       ama_sendout_task = NULL;
static osMessageQueueId_t ama_sendout_queue = NULL;

/* Private constants ---------------------------------------------------------*/

static const osThreadAttr_t ama_sendout_task_attributes = {
    .name       = "Sidewalk AMA Sendout Task",
    .priority   = TASK_PRIO_BLE_HOST + 1u, /* Keep the priority above BLE Host task so AMA won't be preempted immediately on triggering first BLE API call */
    .stack_size = RTOS_STACK_SIZE_NORMAL,
    .attr_bits  = TASK_DEFAULT_ATTR_BITS,
    .cb_mem     = TASK_DEFAULT_CB_MEM,
    .cb_size    = TASK_DEFAULT_CB_SIZE,
    .stack_mem  = TASK_DEFAULT_STACK_MEM,
};

static const osMessageQueueAttr_t ama_sendout_queue_attributes = {
    .name       =  "Sidewalk AMA Sendout Queue",
    .attr_bits  = QUEUE_DEFAULT_ATTR_BITS,
    .cb_mem     = QUEUE_DEFAULT_CB_MEM,
    .cb_size    = QUEUE_DEFAULT_CB_SIZE,
    .mq_mem     = QUEUE_DEFAULT_MQ_MEM,
    .mq_size    = QUEUE_DEFAULT_MQ_SIZE,
};

static const sid_ble_ext_conn_params_limits_t sidewalk_conn_limits ={
    .interval_min       = SID_BLE_SPEC_CONN_INTERVAL_MIN,
    .interval_max       = SID_BLE_SPEC_CONN_INTERVAL_MAX,
    .latency_max        = SID_BLE_HCI_CONN_LATENCY_UPPER_LIMIT,
    .reasonable_timeout = SID_BLE_REASONABLE_CONN_TIMEOUT,
    .ce_length_min      = SID_BLE_HCI_CONN_EVENT_LENGTH_LOWER_LIMIT,
    .ce_length_max      = SID_BLE_HCI_CONN_EVENT_LENGTH_UPPER_LIMIT,
};

/* Imported variables --------------------------------------------------------*/

extern sid_pal_ble_adapter_ctx_t sid_ble_drv_ctx;

