stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
/* Private function prototypes -----------------------------------------------*/

static inline void                  _ble_adapter_sidewalk_invalidate_ama_svc_ctx(void);
static inline SVCCTL_EvtAckStatus_t _ble_adapter_sidewalk_process_gatt_attr_modified_evt(const aci_gatt_attribute_modified_event_rp0 * const evt);
#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
static inline SVCCTL_EvtAckStatus_t _ble_adapter_sidewalk_process_gap_char_read_req(const uint16_t att_handle);
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
static inline SVCCTL_EvtAckStatus_t _ble_adapter_sidewalk_process_hci_le_meta_evt(const evt_le_meta_event * const evt);
static        SVCCTL_EvtAckStatus_t _ble_adapter_sidewalk_svc_evt_handler(void *p_Event);
static        sid_error_t           _ble_adapter_sidewalk_ama_gatt_send_out(uint8_t * const data, const uint32_t length);
static        void                  _ble_adapter_sidewalk_ama_process_send_out(void* thread_input);

static        sid_error_t           _ble_adapter_sidewalk_service_init(sid_ble_adapter_sid_gatt_svc_ctx_t * const out_svc_ctx, const sid_ble_adapter_sid_gatt_svc_init_t * const ble_svc_init);
static        sid_error_t           _ble_adapter_sidewalk_add_characteristics(sid_ble_adapter_sid_gatt_svc_ctx_t * const out_svc_ctx, const sid_ble_cfg_gatt_profile_t * const service_def);
static        sid_error_t           _ble_adapter_sidewalk_services_init(const sid_ble_config_t * const sid_ble_cfg);
static        sid_error_t           _ble_adapter_sidewalk_service_deinit(sid_ble_adapter_sid_gatt_svc_ctx_t * const svc_ctx);
static        sid_error_t           _ble_adapter_sidewalk_services_deinit(void);

static        sid_error_t           _ble_adapter_sidewalk_init(const sid_ble_config_t * cfg);
static        sid_error_t           _ble_adapter_sidewalk_start_service(void);
static inline sid_error_t           _ble_adapter_sidewalk_set_adv_params(const uint32_t adv_interval);
static        sid_error_t           _ble_adapter_sidewalk_set_adv_data(uint8_t *mfg_data, uint8_t mfg_length);
static        sid_error_t           _ble_adapter_sidewalk_start_advertisement(void);
static        sid_error_t           _ble_adapter_sidewalk_stop_advertisement(void);
static        sid_error_t           _ble_adapter_sidewalk_get_rssi(int8_t * rssi);
static        sid_error_t           _ble_adapter_sidewalk_get_tx_pwr(int8_t * tx_power);
static        sid_error_t           _ble_adapter_sidewalk_send_data(sid_ble_cfg_service_identifier_t id, uint8_t * data, uint16_t length);
static        sid_error_t           _ble_adapter_sidewalk_set_callbacks(const sid_pal_ble_adapter_callbacks_t * cb);
static        sid_error_t           _ble_adapter_sidewalk_set_tx_pwr(int8_t tx_power);
static        sid_error_t           _ble_adapter_sidewalk_disconnect(void);
static        sid_error_t           _ble_adapter_sidewalk_deinit(void);

/* Private constants ---------------------------------------------------------*/

/**
 * @brief Sidewalk-specific BLE interface
 * @warning This interface shall be used by Sidewalk stack only. Using it from the user app will result in undefined behavior
 */
static const struct sid_pal_ble_adapter_interface sidwalk_ble_ifc = {
    .init          = _ble_adapter_sidewalk_init,
    .start_service = _ble_adapter_sidewalk_start_service,
    .set_adv_data  = _ble_adapter_sidewalk_set_adv_data,
    .start_adv     = _ble_adapter_sidewalk_start_advertisement,
    .stop_adv      = _ble_adapter_sidewalk_stop_advertisement,
    .get_rssi      = _ble_adapter_sidewalk_get_rssi,
    .get_tx_pwr    = _ble_adapter_sidewalk_get_tx_pwr,
    .send          = _ble_adapter_sidewalk_send_data,
    .set_callback  = _ble_adapter_sidewalk_set_callbacks,
    .set_tx_pwr    = _ble_adapter_sidewalk_set_tx_pwr,
    .disconnect    = _ble_adapter_sidewalk_disconnect,
    .deinit        = _ble_adapter_sidewalk_deinit,
};

/* Private function definitions ----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _ble_adapter_sidewalk_invalidate_ama_svc_ctx(void)
{
    sid_pal_enter_critical_region();

    sid_ble_sidewalk_ctx.ama_ctx.service_context.service_handle      = SID_STM32_BLE_HANDLE_INVALID_VALUE;
    sid_ble_sidewalk_ctx.ama_ctx.service_context.num_characteristics = 0u;

    sid_ble_sidewalk_ctx.ama_ctx.inbox_char_handle                   = SID_STM32_BLE_HANDLE_INVALID_VALUE;
    sid_ble_sidewalk_ctx.ama_ctx.inbox_char_index                    = 0u;
    sid_ble_sidewalk_ctx.ama_ctx.outbox_char_handle                  = SID_STM32_BLE_HANDLE_INVALID_VALUE;
    sid_ble_sidewalk_ctx.ama_ctx.outbox_char_index                   = 0u;

    if (sid_ble_sidewalk_ctx.ama_ctx.service_context.characteristic_context != NULL)
    {
        free(sid_ble_sidewalk_ctx.ama_ctx.service_context.characteristic_context);
        sid_ble_sidewalk_ctx.ama_ctx.service_context.characteristic_context = NULL;
    }

    if (sid_ble_sidewalk_ctx.ama_ctx.inbox_buf != NULL)
    {
        free(sid_ble_sidewalk_ctx.ama_ctx.inbox_buf);
        sid_ble_sidewalk_ctx.ama_ctx.inbox_buf = NULL;
    }
    sid_ble_sidewalk_ctx.ama_ctx.inbox_valid_length = 0u;
    sid_pal_exit_critical_region();
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline SVCCTL_EvtAckStatus_t _ble_adapter_sidewalk_process_gatt_attr_modified_evt(const aci_gatt_attribute_modified_event_rp0 * const evt)
{
    SVCCTL_EvtAckStatus_t evt_ack_status = SVCCTL_EvtNotAck;

    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.conn_ctx != NULL);

    do
    {
        /* Do not process access to the General Attribute Service, this is handled by the generic part of the driver */
        if (evt->Attr_Handle == (SID_STM32_BLE_GATT_SVC_SERVICE_CHANGED_CHAR_HANDLE + SID_STM32_BLE_CHARACTERISTIC_CCCD_ATTRIBUTE_OFFSET))
        {
            break;
        }

        /* AMA Inbox characteristic access */
        if (evt->Attr_Handle == (sid_ble_sidewalk_ctx.ama_ctx.inbox_char_handle + SID_STM32_BLE_CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))
        {
            /* Ensure the connection comes from Sidewalk link */
            if (evt->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id)
            {
                /* Terminate the violating connection */
                SID_PAL_LOG_WARNING("Access to Sidewalk GATT characteristic from non-Sidewalk BLE connection (0x%04X). Access denied", evt->Connection_Handle);
                aci_gap_terminate(evt->Connection_Handle, SID_BLE_HCI_STATUS_AUTH_FAILURE);
                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                break;
            }

            const size_t buffer_offset = (evt->Offset & (~SID_STM32_BLE_ACI_GATT_ATTRIBUTE_MODIFIED_MORE_DATA_PENDING_FLAG));
            const uint32_t more_data_pending = (evt->Offset & SID_STM32_BLE_ACI_GATT_ATTRIBUTE_MODIFIED_MORE_DATA_PENDING_FLAG) != 0u;

            /* Ensure there are no systematic SW failures */
            SID_PAL_ASSERT(sid_ble_sidewalk_ctx.ama_ctx.inbox_buf != NULL);

            /* Check the received data does not exceed the receiving buffer size */
            if ((buffer_offset + evt->Attr_Data_Length) > SID_STM32_BLE_ATT_LEN_LIMIT(sid_ble_drv_ctx.cfg->sidewalk_profile.max_att_mtu))
            {
                if (FALSE == more_data_pending) /* Print out the warning only once */
                {
                    SID_PAL_LOG_WARNING("AMA data received exceeds processing buffer size. Data discarded");
                }
                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                break;
            }

            SID_PAL_LOG_DEBUG("==>>AMA Inbox: received %u bytes%s", evt->Attr_Data_Length, more_data_pending ? ". More data pending" : "");
            SID_STM32_UTIL_fast_memcpy(&(sid_ble_sidewalk_ctx.ama_ctx.inbox_buf[buffer_offset]), evt->Attr_Data, evt->Attr_Data_Length);
            sid_ble_sidewalk_ctx.ama_ctx.inbox_valid_length += evt->Attr_Data_Length;

            /* Call Sidewalk stack if all the data read out from the BLE stack */
            if (more_data_pending == FALSE)
            {
                SID_PAL_LOG_DEBUG("==>>AMA Inbox: RX finished, totally received %u bytes", sid_ble_sidewalk_ctx.ama_ctx.inbox_valid_length);

