stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
                if ((sid_ble_sidewalk_ctx.event_callbacks != NULL) && (sid_ble_sidewalk_ctx.event_callbacks->data_callback != NULL))
                {
                    sid_ble_sidewalk_ctx.event_callbacks->data_callback(AMA_SERVICE, sid_ble_sidewalk_ctx.ama_ctx.inbox_buf, sid_ble_sidewalk_ctx.ama_ctx.inbox_valid_length);
                }
                else
                {
                    SID_PAL_LOG_WARNING("No callback set for Sidewalk AMA inbox. Data discarded");
                }

                /* Reset the data accumulator offset */
                sid_ble_sidewalk_ctx.ama_ctx.inbox_valid_length = 0u;
            }

            /* This event is processed, no further actions are required */
            evt_ack_status = SVCCTL_EvtAckFlowEnable;
            break;
        }
        /* AMA Outbox characteristic CCCD access */
        else if (evt->Attr_Handle == (sid_ble_sidewalk_ctx.ama_ctx.outbox_char_handle + SID_STM32_BLE_CHARACTERISTIC_CCCD_ATTRIBUTE_OFFSET))
        {
            /* Ensure the connection comes from Sidewalk link */
            if (evt->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id)
            {
                /* Terminate the violating connection */
                SID_PAL_LOG_WARNING("Access to Sidewalk GATT characteristic from non-Sidewalk BLE connection (0x%04X). Access denied", evt->Connection_Handle);
                aci_gap_terminate(evt->Connection_Handle, SID_BLE_HCI_STATUS_AUTH_FAILURE);
                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                break;
            }

            /* Ensure the correct amount of data is written */
            if (evt->Attr_Data_Length != SID_STM32_BLE_CHARACTERISTIC_CCCD_ATTRIBUTE_SIZE)
            {
                /* Terminate the violating connection */
                SID_PAL_LOG_WARNING("Wrong CCCD data length write attempt. Connection handle 0x%04X", evt->Connection_Handle);
                aci_gap_terminate(evt->Connection_Handle, SID_BLE_HCI_STATUS_AUTH_FAILURE);
                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                break;
            }

            const uint16_t cccd_value = (uint16_t)((evt->Attr_Data[0] & 0xFFu) | ((evt->Attr_Data[1] << 8) & 0xFF00u));
            SID_PAL_LOG_DEBUG("  AMA Outbox service CCCD attribute changed to 0x%04x", cccd_value);

            sid_ble_sidewalk_ctx.ama_ctx.is_notification_enabled = (cccd_value & SID_STM32_BLE_CHARACTERISTIC_CCCD_NOTIFY_BIT_MASK) != 0u ? TRUE : FALSE;
            if (sid_ble_sidewalk_ctx.ama_ctx.is_notification_enabled != FALSE)
            {
                SID_PAL_LOG_DEBUG("==>>Remote client subscribed to AMA Outbox notifications");
            }
            else
            {
                SID_PAL_LOG_DEBUG("==>>Remote client unsubscribed from AMA Outbox notifications");
            }
            if ((sid_ble_sidewalk_ctx.event_callbacks != NULL) && (sid_ble_sidewalk_ctx.event_callbacks->notify_callback != NULL))
            {
                sid_ble_sidewalk_ctx.event_callbacks->notify_callback(AMA_SERVICE, sid_ble_sidewalk_ctx.ama_ctx.is_notification_enabled);
            }

            /* This event is processed, no further actions are required */
            evt_ack_status = SVCCTL_EvtAckFlowEnable;
        }
        else
        {
            /* Do nothing, let the other handlers to process the event */
        }
    } while (0);

    return evt_ack_status;
}

/*----------------------------------------------------------------------------*/

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
SID_STM32_SPEED_OPTIMIZED static inline SVCCTL_EvtAckStatus_t _ble_adapter_sidewalk_process_gap_char_read_req(const uint16_t att_handle)
{
    SVCCTL_EvtAckStatus_t evt_ack_status = SVCCTL_EvtNotAck;

    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.conn_ctx != NULL);

    do
    {
        /* Handle GAP Device Name characteristic access */
        if (att_handle == (sid_ble_drv_ctx.gap_dev_name_char_handle + SID_STM32_BLE_CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))
        {
            tBleStatus ble_status;
            const char * const gap_device_name = sid_ble_drv_ctx.cfg->sidewalk_profile.device_name;
            uint16_t gap_device_name_len = (NULL == gap_device_name) ? 0u : strlen(gap_device_name);

            if (gap_device_name_len > SID_STM32_BLE_GAP_DEVICE_NAME_MAX_LEN)
            {
                gap_device_name_len = SID_STM32_BLE_GAP_DEVICE_NAME_MAX_LEN;
            }

            /* Update GAP device name */
            ble_status = aci_gatt_update_char_value(sid_ble_drv_ctx.gap_service_handle,
                                                    sid_ble_drv_ctx.gap_dev_name_char_handle,
                                                    0u,
                                                    gap_device_name_len,
                                                    (uint8_t *)gap_device_name);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                /* Failed to update GAP Device Name - prohibit reading since the characterstic will have wrong value */
                SID_BLE_SIDEWALK_LOG_ERROR("  Fail   : aci_gatt_update_char_value - Device Name, result: 0x%02X", ble_status);
                evt_ack_status = SVCCTL_EvtAckFlowDisable;
                break;
            }
            else
            {
                /* Successfully updated GAP Device Name characterstic with the name of the current Virtual BLE device */
                SID_BLE_SIDEWALK_LOG_DEBUG("  Success: aci_gatt_update_char_value - Device Name");
                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                break; /* Exit from here since we don't need to invoke user callback for GAP characteristics */
            }
        }

        /* Handle GAP Appearance characteristic access */
        if (att_handle == (sid_ble_drv_ctx.gap_appearance_char_handle + SID_STM32_BLE_CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))
        {
            tBleStatus ble_status;
            const uint16_t gap_appearance = sid_ble_drv_ctx.cfg->sidewalk_profile.appearance;

            /* Update GAP appearance */
            ble_status = aci_gatt_update_char_value(sid_ble_drv_ctx.gap_service_handle,
                                                    sid_ble_drv_ctx.gap_appearance_char_handle,
                                                    0u,
                                                    sizeof(gap_appearance),
                                                    (uint8_t *)(void *)&gap_appearance);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                SID_BLE_SIDEWALK_LOG_ERROR("  Fail   : aci_gatt_update_char_value - Appearance, result: 0x%02X", ble_status);
                evt_ack_status = SVCCTL_EvtAckFlowDisable;
                break;
            }
            else
            {
                SID_BLE_SIDEWALK_LOG_DEBUG("  Success: aci_gatt_update_char_value - Appearance");
                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                break;
            }
        }

        /* Handle GAP Preferred Connection Parameters characteristic access */
        if (att_handle == (sid_ble_drv_ctx.gap_ppcp_char_handle + SID_STM32_BLE_CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))
        {
            const sid_ble_cfg_conn_param_t * const conn_param = &sid_ble_sidewalk_ctx.ble_cfg->conn_param;

            if (conn_param != NULL)
            {
                (void)sid_stm32wba_ble_adapter_util_set_gap_ppcp_char(conn_param);
            }

            evt_ack_status = SVCCTL_EvtAckFlowEnable;
            break;
        }
    } while (0);

    return evt_ack_status;
}
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */

