stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline SVCCTL_EvtAckStatus_t _ble_adapter_sidewalk_process_hci_le_meta_evt(const evt_le_meta_event * const evt)
{
    SVCCTL_EvtAckStatus_t evt_ack_status = SVCCTL_EvtNotAck;

    do
    {
        switch (evt->subevent)
        {
            case HCI_LE_DATA_LENGTH_CHANGE_SUBEVT_CODE:
                {
                    const hci_le_data_length_change_event_rp0 * const p_le_data_length_change = (hci_le_data_length_change_event_rp0 *)evt->data;

                    if (p_le_data_length_change->Connection_Handle == sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id)
                    {
                        SID_PAL_LOG_INFO("Sidewalk BLE DLE: MaxTxOctets: %u, MaxTxTime: %uus, MaxRxOctets: %u, MaxRxTime: %uus",
                                         p_le_data_length_change->MaxTxOctets,
                                         p_le_data_length_change->MaxTxTime,
                                         p_le_data_length_change->MaxRxOctets,
                                         p_le_data_length_change->MaxRxTime);

                        /* Event processing is finished */
                        evt_ack_status = SVCCTL_EvtAckFlowEnable;
                    }
                }
                break;

            default:
                /* Do nothing, allow the event flow to continue */
                break;
        }
    } while (0);

    return evt_ack_status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static SVCCTL_EvtAckStatus_t _ble_adapter_sidewalk_svc_evt_handler(void *p_Event)
{
    SVCCTL_EvtAckStatus_t evt_ack_status = SVCCTL_EvtNotAck;

    do
    {
        const hci_event_pckt * const p_event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)p_Event)->data);
        const evt_blecore_aci *      p_blecore_evt;

        /* Check if Sidewalk link is up */
        if (NULL == sid_ble_sidewalk_ctx.conn_ctx)
        {
            /* No active connection, nothing to process */
            evt_ack_status = SVCCTL_EvtNotAck;
            break;
        }

        switch(p_event_pckt->evt)
        {
            case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
                p_blecore_evt = (evt_blecore_aci*)p_event_pckt->data;

                switch(p_blecore_evt->ecode)
                {
                    case ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE:
                        evt_ack_status = _ble_adapter_sidewalk_process_gatt_attr_modified_evt((aci_gatt_attribute_modified_event_rp0 *)p_blecore_evt->data);
                        break;

                    case ACI_GATT_NOTIFICATION_COMPLETE_VSEVT_CODE:
                        {
                            const aci_gatt_notification_complete_event_rp0 * const p_notification_complete = (aci_gatt_notification_complete_event_rp0 *)p_blecore_evt->data;

                            if (p_notification_complete->Attr_Handle == (sid_ble_sidewalk_ctx.ama_ctx.outbox_char_handle + SID_STM32_BLE_CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))
                            {
                                /* Invoke TX completion callback */
                                SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks != NULL);
                                SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks->ind_callback != NULL);
                                sid_ble_sidewalk_ctx.event_callbacks->ind_callback(TRUE);

                                SID_PAL_LOG_DEBUG("==>> AMA Outbox upload completed");

                                /* Event processing is finished */
                                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                            }
                        }
                        break;

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                    case ACI_GATT_READ_PERMIT_REQ_VSEVT_CODE:
                        {
                            const aci_gatt_read_permit_req_event_rp0 * const p_read_permit_req = (aci_gatt_read_permit_req_event_rp0 *)p_blecore_evt->data;
                            uint8_t resp_error_code = SID_STM32_BLE_ATT_STATUS_APP_ERROR_GENERIC;
                            tBleStatus ble_status;

                            /* Ensure we are processing only Sidewalk-related access */
                            if (p_read_permit_req->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id)
                            {
                                break;
                            }

                            evt_ack_status = _ble_adapter_sidewalk_process_gap_char_read_req(p_read_permit_req->Attribute_Handle);

                            /* Send the response */
                            if (SVCCTL_EvtAckFlowEnable == evt_ack_status)
                            {
                                ble_status = aci_gatt_allow_read(p_read_permit_req->Connection_Handle);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to allow read for BLE connection 0x%04X, attribute 0x%04X. ACI error 0x%02X", p_read_permit_req->Connection_Handle, p_read_permit_req->Attribute_Handle, ble_status);
                                    (void)aci_gap_terminate(p_read_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                }
                            }
                            else if (SVCCTL_EvtAckFlowDisable == evt_ack_status)
                            {
                                SID_PAL_LOG_WARNING("Rejected read request for BLE connection 0x%04X, attribute 0x%04X. Reason code 0x%02X", p_read_permit_req->Connection_Handle, p_read_permit_req->Attribute_Handle, resp_error_code);

                                ble_status = aci_gatt_deny_read(p_read_permit_req->Connection_Handle, resp_error_code);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to deny read for BLE connection 0x%04X, attribute 0x%04X. ACI error 0x%02X", p_read_permit_req->Connection_Handle, p_read_permit_req->Attribute_Handle, ble_status);
                                    (void)aci_gap_terminate(p_read_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                }

                                /* Done with processing of this event */
                                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                            }
                            else
                            {
                                /* Nothing to do here */
                            }
                        }
                        break;

                    case ACI_GATT_READ_MULTI_PERMIT_REQ_VSEVT_CODE:
                        {
                            const aci_gatt_read_multi_permit_req_event_rp0 * const p_read_multi_permit_req = (aci_gatt_read_multi_permit_req_event_rp0 *)p_blecore_evt->data;
                            uint8_t resp_error_code = SID_STM32_BLE_ATT_STATUS_APP_ERROR_GENERIC;
                            tBleStatus ble_status;

                            /* Ensure we are processing only Sidewalk-related access */
                            if (p_read_multi_permit_req->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id)
                            {
                                break;
                            }

                            for (uint32_t i = 0u; i < p_read_multi_permit_req->Number_of_Handles; i++)
                            {
                                evt_ack_status = _ble_adapter_sidewalk_process_gap_char_read_req(p_read_multi_permit_req->Handle_Item[i].Handle);
                                if (evt_ack_status != SVCCTL_EvtAckFlowEnable)
                                {
                                    break;
                                }
                            }

                            /* Send the response */
                            if (SVCCTL_EvtAckFlowEnable == evt_ack_status)
                            {
                                ble_status = aci_gatt_allow_read(p_read_multi_permit_req->Connection_Handle);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to allow multiple attribute read for BLE connection 0x%04X. ACI error 0x%02X", p_read_multi_permit_req->Connection_Handle, ble_status);
                                    (void)aci_gap_terminate(p_read_multi_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                }
                            }
                            else if (SVCCTL_EvtAckFlowDisable == evt_ack_status)
                            {
                                SID_PAL_LOG_WARNING("Rejected read multiple request for BLE connection 0x%04X. Reason code 0x%02X", p_read_multi_permit_req->Connection_Handle, resp_error_code);

                                ble_status = aci_gatt_deny_read(p_read_multi_permit_req->Connection_Handle, resp_error_code);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to deny multiple attribute read for BLE connection 0x%04X. ACI error 0x%02X", p_read_multi_permit_req->Connection_Handle, ble_status);
                                    (void)aci_gap_terminate(p_read_multi_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                }

                                /* Done with processing of this event */
                                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                            }
                            else
                            {
                                /* Nothing to do here */
                            }
                        }
                        break;
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */

                    default:
                        /* Allow other handlers to process this event */
                        break;
                }
                break;

            case HCI_LE_META_EVT_CODE:
                evt_ack_status = _ble_adapter_sidewalk_process_hci_le_meta_evt((evt_le_meta_event *)p_event_pckt->data);
                break;

            default:
                /* Allow other handlers to process this event */
                break;
        }
    } while (0);

    return evt_ack_status;
}

