stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_ama_gatt_send_out(uint8_t * const data, const uint32_t length)
{
    sid_error_t status = SID_ERROR_GENERIC;
    tBleStatus ble_ret = BLE_STATUS_ERROR;

    if ((NULL == sid_ble_sidewalk_ctx.conn_ctx)
         || (FALSE == sid_ble_sidewalk_ctx.ama_ctx.is_notification_enabled)
         || (SID_STM32_BLE_HANDLE_INVALID_VALUE == sid_ble_sidewalk_ctx.ama_ctx.service_context.service_handle)
         || (SID_STM32_BLE_HANDLE_INVALID_VALUE == sid_ble_sidewalk_ctx.ama_ctx.outbox_char_handle))
    {
        return SID_ERROR_INVALID_STATE;
    }

    /* Use aci_gatt_update_char_value_ext() instead of aci_gatt_update_char_value() to support MTU sizes greater than 251 bytes */
    if (length <= SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT)
    {
        ble_ret = aci_gatt_update_char_value_ext(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id,
                                                 sid_ble_sidewalk_ctx.ama_ctx.service_context.service_handle,
                                                 sid_ble_sidewalk_ctx.ama_ctx.outbox_char_handle,
                                                 SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_TYPE_NOTIFY,
                                                 (uint16_t)length,
                                                 0u, /* value offset */
                                                 (uint8_t)length,
                                                 data);
    }
    else
    {
        /* Use several subsequent calls to pass all the data to BLE stack. Since maximum MTU size is 512 bytes we may need up to 3 calls */
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> aci_gatt_update_char_value_ext - sending out   long data (%u bytes)", length);

        uint32_t remaining_data_size = length;
        uint32_t current_offset = 0u;

        while (remaining_data_size > SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT)
        {
            /* First call just pushes the data but does not trigger the actual value change notification */
            ble_ret = aci_gatt_update_char_value_ext(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id,
                                                     sid_ble_sidewalk_ctx.ama_ctx.service_context.service_handle,
                                                     sid_ble_sidewalk_ctx.ama_ctx.outbox_char_handle,
                                                     SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_TYPE_DO_NOT_NOTIFY,
                                                     (uint16_t)length, /* total length */
                                                     (uint16_t)current_offset, /* value offset */
                                                     SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT, /* size of the partial data to push */
                                                     data + current_offset);
            if (BLE_STATUS_SUCCESS == ble_ret)
            {
                SID_BLE_SIDEWALK_LOG_DEBUG("==>> aci_gatt_update_char_value_ext - updated partial data, start offset: %u, bytes written: %u, remaining size: %u", current_offset, SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT, remaining_data_size - SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT);
                current_offset += SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT;
                remaining_data_size -= SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT;
            }
            else
            {
                SID_BLE_SIDEWALK_LOG_DEBUG("==>> aci_gatt_update_char_value_ext - fail on putting partial data, start offset: %u, total length: %u, result: 0x%02X", current_offset, length, ble_ret);
                break;
            }
        }

        if (BLE_STATUS_SUCCESS == ble_ret)
        {
            /* The last call uploads the rest of the data and triggers BLE notification indication */
            ble_ret = aci_gatt_update_char_value_ext(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id,
                                                     sid_ble_sidewalk_ctx.ama_ctx.service_context.service_handle,
                                                     sid_ble_sidewalk_ctx.ama_ctx.outbox_char_handle,
                                                     SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_TYPE_NOTIFY,
                                                     (uint16_t)length, /* total length */
                                                     (uint16_t)current_offset, /* value offset */
                                                     (uint8_t)remaining_data_size, /* size of the remaining partial data to push */
                                                     data + current_offset);
        }
    }

    if (BLE_STATUS_SUCCESS == ble_ret)
    {
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> aci_gatt_update_char_value_ext - success, %u bytes written", length);
        status = SID_ERROR_NONE;
    }
    else if (BLE_STATUS_INSUFFICIENT_RESOURCES == ble_ret)
    {
        SID_BLE_SIDEWALK_LOG_WARNING("==>> aci_gatt_update_char_value_ext - recoverable failure, insufficient resources");
        status = SID_ERROR_BUSY;
    }
    else
    {
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> aci_gatt_update_char_value_ext - fail, result: 0x%02X", ble_ret);
        status = SID_ERROR_IO_ERROR;
    }

    return status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static void _ble_adapter_sidewalk_ama_process_send_out(void* thread_input)
{
    UNUSED(thread_input);

    while (1)
    {
        osStatus_t status;
        AMAMessageQueueElement_t msg_descriptor;
        sid_error_t gatt_status;
        uint32_t retry_counter = 0u;

        status = osMessageQueueGet(ama_sendout_queue, &msg_descriptor, NULL, osWaitForever);
        if (status != osOK)
        {
            SID_PAL_LOG_WARNING("Unable to fetch outgoing AMA message from queue. Status code: %d", status);
            continue;
        }

