stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
        if ((NULL == msg_descriptor.data) || (0u == msg_descriptor.length))
        {
            SID_PAL_LOG_WARNING("Empty message fetched from outgoing AMA message from queue. Send out will be ignored");
            continue;
        }

        SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks != NULL);
        SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks->ind_callback != NULL);

        do
        {
            gatt_status = _ble_adapter_sidewalk_ama_gatt_send_out(msg_descriptor.data, msg_descriptor.length);

            if (SID_ERROR_NONE == gatt_status)
            {
                /* Notification sent */
                SID_PAL_LOG_DEBUG("==>> Successfully put %d bytes into AMA Outbox", msg_descriptor.length);
                break;
            }
            else if (SID_ERROR_BUSY == gatt_status)
            {
                /*  Recoverable state, try again a bit later */
                retry_counter++;
                osDelay(2);
            }
            else
            {
                /* Unrecoverable error, stop processing */
                switch (gatt_status)
                {
                    case SID_ERROR_INVALID_STATE:
                        SID_PAL_LOG_ERROR("==>> Unable to send out AMA message. No valid connection opened. Message will be lost");
                        break;
                    
                    default:
                        SID_PAL_LOG_ERROR("==>> Unable to write AMA message to outbox. Status code: %d", gatt_status);
                        break;
                }

                /* Invoke TX completion callback */
                sid_ble_sidewalk_ctx.event_callbacks->ind_callback(FALSE);
                break;
            }
        } while ((gatt_status != SID_ERROR_NONE) && (retry_counter <= 10));

        /* Finally release the RAM occupied by the message */
        free(msg_descriptor.data);
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_service_init(sid_ble_adapter_sid_gatt_svc_ctx_t * const out_svc_ctx, const sid_ble_adapter_sid_gatt_svc_init_t * const ble_svc_init)
{
    sid_error_t err;
    tBleStatus  ble_status;

    do
    {
        /* Validate input params */
        if ((NULL == out_svc_ctx) || (NULL == ble_svc_init) || (NULL == ble_svc_init->service_def))
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Copy service UUID and ID */
        out_svc_ctx->service_info = ble_svc_init->service_def->service;

        /* Allocate memory for characteristics of the service */
        out_svc_ctx->num_characteristics = ble_svc_init->service_def->char_count;
        out_svc_ctx->characteristic_context = (sid_ble_adapter_sid_gatt_char_ctx_t*)malloc(sizeof(*out_svc_ctx->characteristic_context) * out_svc_ctx->num_characteristics);
        if (NULL == out_svc_ctx->characteristic_context)
        {
            SID_PAL_LOG_ERROR("  Failed to allocate memory for GATT service context storage");
            err = SID_ERROR_OOM;
            break;
        }

        /* Add service */
        uint8_t stm_uuid_type;
        Service_UUID_t stm_uuid;
        char msg_buf[100];

        err = sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_svc_uuid(&stm_uuid_type, &stm_uuid, &out_svc_ctx->service_info.id);
        if (err != SID_ERROR_NONE)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("  Fail   : sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_svc_uuid command, error code: %d", err);
            break;
        }

        ble_status = aci_gatt_add_service(stm_uuid_type,
                                          &stm_uuid,
                                          PRIMARY_SERVICE,
                                          (2u * (ble_svc_init->service_def->char_count + ble_svc_init->service_def->desc_count)) + 2u, /* Max_Attribute_Records = 2*no_of_char + 2*num_of_desc + 2 for svc */
                                          &(out_svc_ctx->service_handle));
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            int pos = sprintf(msg_buf, "  Fail   : aci_gatt_add_service command for service ");
            pos += sid_stm32wba_ble_adapter_util_sprintf_uuid(&msg_buf[pos], &out_svc_ctx->service_info.id);
            pos += sprintf(&msg_buf[pos], ", error code: 0x%02X", ble_status);
            SID_BLE_SIDEWALK_LOG_ERROR("%s", msg_buf);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        else
        {
            int pos = sprintf(msg_buf, "  Success: aci_gatt_add_service command for service ");
            pos += sid_stm32wba_ble_adapter_util_sprintf_uuid(&msg_buf[pos], &out_svc_ctx->service_info.id);
            SID_BLE_SIDEWALK_LOG_DEBUG("%s", msg_buf);
        }

        /* Add characteristics */
        err = _ble_adapter_sidewalk_add_characteristics(out_svc_ctx, ble_svc_init->service_def);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Add event handler */
        out_svc_ctx->event_handler = ble_svc_init->svc_event_handler;
        if (out_svc_ctx->event_handler != NULL)
        {
            err = sid_stm32wba_ble_adapter_prv_generic_register_svc_handler(out_svc_ctx->event_handler);
            if (err != SID_ERROR_NONE)
            {
                int pos = sprintf(msg_buf, "  Fail   : unable to register event handler for service ");
                (void)sid_stm32wba_ble_adapter_util_sprintf_uuid(&msg_buf[pos], &out_svc_ctx->service_info.id);
                SID_BLE_SIDEWALK_LOG_ERROR("%s, error %d", msg_buf, (int32_t)err);

                out_svc_ctx->event_handler = NULL;
                break;
            }
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_add_characteristics(sid_ble_adapter_sid_gatt_svc_ctx_t * const out_svc_ctx, const sid_ble_cfg_gatt_profile_t * const service_def)
{
    sid_error_t err = SID_ERROR_GENERIC;

    SID_PAL_ASSERT(sid_ble_drv_ctx.cfg != NULL);
    SID_PAL_ASSERT(out_svc_ctx);
    SID_PAL_ASSERT(service_def);
    SID_PAL_ASSERT(out_svc_ctx->num_characteristics == service_def->char_count);

    for (uint32_t i = 0u; i < service_def->char_count; i++)
    {
        Char_UUID_t stm_uuid;
        uint8_t stm_uuid_type;
        tBleStatus ble_status;
        char msg_buf[100];
        sid_ble_adapter_sid_gatt_char_ctx_t * const current_char_ctx = &(out_svc_ctx->characteristic_context[i]);
        const sid_ble_cfg_characteristics_t * const char_def = &(service_def->characteristic[i]);

        /* Copy UUID */
        current_char_ctx->characteristic_info = *char_def;

        /* Convert UUID to STM BLE stack format */
        err = sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_char_uuid(&stm_uuid_type, &stm_uuid, &current_char_ctx->characteristic_info.id);
        if (err != SID_ERROR_NONE)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("  Fail   : sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_char_uuid command, error code: %d", err);
            break;
        }

        /* Compute characteristic settings */
        uint8_t char_props = CHAR_PROP_NONE;
        uint8_t event_mask = GATT_DONT_NOTIFY_EVENTS;
        if (char_def->properties.is_read != false)
        {
            char_props |= CHAR_PROP_READ;
            event_mask |= GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP;
        }
        if (char_def->properties.is_write != false)
        {
            char_props |= CHAR_PROP_WRITE;
            event_mask |= (GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP);
        }
        if (char_def->properties.is_write_no_resp != false)
        {
            char_props |= CHAR_PROP_WRITE_WITHOUT_RESP;
            event_mask |= (GATT_NOTIFY_ATTRIBUTE_WRITE);
        }
        if (char_def->properties.is_notify != false)
        {
            char_props |= CHAR_PROP_NOTIFY;
            event_mask |= (GATT_NOTIFY_NOTIFICATION_COMPLETION);
        }

        uint8_t char_perms = ATTR_PERMISSION_NONE;
        if (char_def->perm.is_none == false)
        {
            if (char_def->perm.is_read != false)
            {
                char_perms |= ATTR_PERMISSION_AUTHEN_READ;
            }
            if (char_def->perm.is_write != false)
            {
                char_perms |= ATTR_PERMISSION_AUTHEN_WRITE;
            }
        }

        ble_status = aci_gatt_add_char(out_svc_ctx->service_handle,
                                       stm_uuid_type,
                                       &stm_uuid,
                                       SID_STM32_BLE_ATT_LEN_LIMIT(sid_ble_drv_ctx.cfg->sidewalk_profile.max_att_mtu),
                                       char_props,
                                       char_perms,
                                       event_mask,
                                       SID_STM32_BLE_CHAR_ENC_KEY_MINIMUM_LENGTH,
                                       CHAR_VALUE_LEN_VARIABLE,
                                       &(current_char_ctx->characteristic_handle));
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            int pos = sprintf(msg_buf, "  Fail   : aci_gatt_add_char command for characteristic ");
            pos += sid_stm32wba_ble_adapter_util_sprintf_uuid(&msg_buf[pos], &(current_char_ctx->characteristic_info.id));
            pos += sprintf(&msg_buf[pos], ", error code: 0x%02X", ble_status);
            SID_BLE_SIDEWALK_LOG_ERROR("%s", msg_buf);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        else
        {
            int pos = sprintf(msg_buf, "  Success: aci_gatt_add_char ");
            pos += sid_stm32wba_ble_adapter_util_sprintf_uuid(&msg_buf[pos], &(current_char_ctx->characteristic_info.id));
            SID_BLE_SIDEWALK_LOG_DEBUG("%s", msg_buf);
        }

        err = SID_ERROR_NONE;
    }

