stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_services_init(const sid_ble_config_t * const sid_ble_cfg)
{
    sid_error_t err = SID_ERROR_GENERIC;

    SID_BLE_SIDEWALK_LOG_DEBUG("==>> Start ble_adapter_sidewalk_services_init function");

    do
    {
        /* Validate inputs */
        if (NULL == sid_ble_cfg)
        {
            SID_PAL_LOG_ERROR("  Fail   : Cannot initialize Sidewalk BLE GATT services. Sidewalk BLE config is NULL");
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        if (NULL == sid_ble_cfg->profile)
        {
            SID_PAL_LOG_ERROR("  Fail   : Cannot initialize Sidewalk BLE GATT services. Profile specification is NULL");
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        if (sid_ble_cfg->num_profile > SID_STM32_BLE_SIDEWALK_NUM_GATT_SERVICES)
        {
            SID_PAL_LOG_ERROR("  Fail   : Invalid WPAN config. Number of the GATT services in profile exceeds SID_STM32_BLE_SIDEWALK_NUM_GATT_SERVICES parameter");
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        // TODO: calculate total attributes count and compare against CFG_BLE_NUM_GATT_ATTRIBUTES

        /* Invalidate AMA service context */
        _ble_adapter_sidewalk_invalidate_ama_svc_ctx();

        for (uint32_t i = 0u; i < sid_ble_cfg->num_profile; i++)
        {
            const sid_ble_cfg_gatt_profile_t * const profile = &sid_ble_cfg->profile[i];
            sid_ble_adapter_sid_gatt_svc_init_t ble_svc_init = {0};

            switch (profile->service.type)
            {
                case AMA_SERVICE:
                    ble_svc_init.svc_event_handler = _ble_adapter_sidewalk_svc_evt_handler;
                    break;

                case VENDOR_SERVICE:
                case LOGGING_SERVICE:
                default:
                    {
                        char buf[90];
                        int pos = sprintf(buf, "Adding GATT service with UUID ");
                        pos += sid_stm32wba_ble_adapter_util_sprintf_uuid(&buf[pos], &profile->service.id);
                        pos += sprintf(&buf[pos]," without event handler");
                        SID_PAL_LOG_WARNING("%s", buf);
                    }
                    break;
            }

            sid_ble_adapter_sid_gatt_svc_ctx_t svc_ctx;
            ble_svc_init.service_def = (sid_ble_cfg_gatt_profile_t *)profile;
            err = _ble_adapter_sidewalk_service_init(&svc_ctx, &ble_svc_init);
            if (err != SID_ERROR_NONE)
            {
                char buf[90];
                int pos = sprintf(buf, "  Failed to initialize GATT service ");
                pos += sid_stm32wba_ble_adapter_util_sprintf_uuid(&buf[pos], &profile->service.id);
                SID_PAL_LOG_ERROR("%s, error %d", buf, (int32_t)err);
                break;
            }

            if (AMA_SERVICE == profile->service.type)
            {
                /* Allocate memory for AMA Inbox buffer */
                SID_PAL_ASSERT(NULL == sid_ble_sidewalk_ctx.ama_ctx.inbox_buf);
                sid_ble_sidewalk_ctx.ama_ctx.inbox_valid_length = 0u;
                sid_ble_sidewalk_ctx.ama_ctx.inbox_buf = malloc(SID_STM32_BLE_ATT_LEN_LIMIT(sid_ble_drv_ctx.cfg->sidewalk_profile.max_att_mtu));
                if (NULL == sid_ble_sidewalk_ctx.ama_ctx.inbox_buf)
                {
                    SID_PAL_LOG_ERROR("Unable to allocate memory for Sidewalk AMA Inbox - no memory");
                    err = SID_ERROR_OOM;
                    break;
                }

                /* Store context for quick access */
                sid_ble_sidewalk_ctx.ama_ctx.service_context = svc_ctx;
                SID_PAL_ASSERT(BLE_AMA_SERVICE_CHAR_COUNT == sid_ble_sidewalk_ctx.ama_ctx.service_context.num_characteristics);
                for (uint32_t i = 0u; i < sid_ble_sidewalk_ctx.ama_ctx.service_context.num_characteristics; i++)
                {
                    const sid_ble_adapter_sid_gatt_char_ctx_t * const char_ctx = &(sid_ble_sidewalk_ctx.ama_ctx.service_context.characteristic_context[i]);
                    if ((char_ctx->characteristic_info.properties.is_read != false) || (char_ctx->characteristic_info.properties.is_notify != false))
                    {
                        sid_ble_sidewalk_ctx.ama_ctx.outbox_char_index = i;
                        sid_ble_sidewalk_ctx.ama_ctx.outbox_char_handle = char_ctx->characteristic_handle;
                        continue;
                    }
                    if ((char_ctx->characteristic_info.properties.is_write != false) || (char_ctx->characteristic_info.properties.is_write_no_resp != false))
                    {
                        sid_ble_sidewalk_ctx.ama_ctx.inbox_char_index = i;
                        sid_ble_sidewalk_ctx.ama_ctx.inbox_char_handle = char_ctx->characteristic_handle;
                        continue;
                    }
                }

                SID_PAL_ASSERT(sid_ble_sidewalk_ctx.ama_ctx.inbox_char_handle != SID_STM32_BLE_HANDLE_INVALID_VALUE);
                SID_PAL_ASSERT(sid_ble_sidewalk_ctx.ama_ctx.outbox_char_handle != SID_STM32_BLE_HANDLE_INVALID_VALUE);
            }
        }

        /* Check if the initialization loop terminated with error */
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    SID_BLE_SIDEWALK_LOG_DEBUG("==>> End ble_adapter_sidewalk_services_init function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_service_deinit(sid_ble_adapter_sid_gatt_svc_ctx_t * const svc_ctx)
{
    sid_error_t err = SID_ERROR_NONE;
    tBleStatus  ble_status;
    char        uuid_str[40];

    SID_PAL_ASSERT(svc_ctx != NULL);

    SID_BLE_SIDEWALK_LOG_DEBUG("==>> Start ble_adapter_sidewalk_service_deinit function");

    (void)sid_stm32wba_ble_adapter_util_sprintf_uuid(uuid_str, &svc_ctx->service_info.id);
    SID_BLE_SIDEWALK_LOG_DEBUG("  Removing GATT service %s with %u characteristics", uuid_str, svc_ctx->num_characteristics);

    /* Remove the service from GATT database */
    ble_status = aci_gatt_del_service(svc_ctx->service_handle);
    if (ble_status != BLE_STATUS_SUCCESS)
    {
        SID_BLE_SIDEWALK_LOG_ERROR("  Fail   : aci_gatt_del_service command for service %s, error code: 0x%02X", uuid_str, ble_status);
        err = SID_ERROR_IO_ERROR;
    }

