stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
    svc_ctx->service_handle = SID_STM32_BLE_HANDLE_INVALID_VALUE;

    /* Deregister the event handler */
    if (svc_ctx->event_handler != NULL)
    {
        (void)sid_stm32wba_ble_adapter_prv_generic_deregister_svc_handler(svc_ctx->event_handler);
        svc_ctx->event_handler = NULL;
    }

    /* Clean up characteristic contexts */
    if (svc_ctx->characteristic_context != NULL)
    {
        free(svc_ctx->characteristic_context);
        svc_ctx->characteristic_context = NULL;
    }
    svc_ctx->num_characteristics = 0u;

    SID_BLE_SIDEWALK_LOG_DEBUG("==>> End ble_adapter_sidewalk_service_deinit function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_services_deinit(void)
{
    sid_error_t err = SID_ERROR_NONE;

    SID_BLE_SIDEWALK_LOG_DEBUG("==>> Start ble_adapter_sidewalk_services_deinit function");

    sid_pal_enter_critical_region();

    /* Delete AMA service from the GATT database */
    err = _ble_adapter_sidewalk_service_deinit(&sid_ble_sidewalk_ctx.ama_ctx.service_context);

    /* Invalidate AMA service context */
    _ble_adapter_sidewalk_invalidate_ama_svc_ctx();

    sid_pal_exit_critical_region();

    SID_BLE_SIDEWALK_LOG_DEBUG("==>> End ble_adapter_sidewalk_services_deinit function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_init(const sid_ble_config_t * cfg)
{
    sid_error_t err = SID_ERROR_GENERIC;
    osStatus_t  os_status;
    uint32_t    ll_lock_acquired;
    const sid_pal_ble_prv_operating_mode_t init_type =
#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                                                  SPBP_OPERATING_MODE_CONCURRENT;
#else
                                                  SPBP_OPERATING_MODE_SIDEWALK;
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY */

    SID_BLE_SIDEWALK_LOG_DEBUG("==>> Start ble_adapter_sidewalk_init function");

    if (sid_ble_sidewalk_ctx.init_done != FALSE)
    {
        SID_PAL_LOG_WARNING("Sidewalk BLE is initialized already. Requesting deinitialization");

        /* Deinitialize any hardware that may have been partially initialized to bring it to the known state */
        err = _ble_adapter_sidewalk_deinit();
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Unable to initialize Sidewalk BLE radio - driver is initialized already and deinitialization failed. Error %d", (int32_t)err);
            return err;
        }
    }

    if (LinkLayerMutex != NULL)
    {
        /* Wait for any potentially ongoing BLE operations to stop */
        os_status = osMutexAcquire(LinkLayerMutex, SID_STM32_BLE_LL_MUTEX_WAIT_TIMEOUT_ON_INIT_TICKS);

        /* Print out warning but proceed */
        if (os_status != osOK)
        {
            SID_PAL_LOG_WARNING("Failed to acquire BLE LL mutex, race conditions are possible during Sidewalk BLE init");
            ll_lock_acquired = FALSE;
        }
        else
        {
            ll_lock_acquired = TRUE;
        }
    }
    else
    {
        /* This is the very first initialization, the mutex is not created yet */
        ll_lock_acquired = FALSE;
    }

    do
    {
#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING)
        if (sid_ble_drv_ctx.operating_mode != SPBP_OPERATING_MODE_OFF)
        {
            SID_PAL_LOG_ERROR("Sidewalk BLE mode cannot be initialized because BLE radio is busy with another mode (%u)", sid_ble_drv_ctx.operating_mode);
            err = SID_ERROR_BUSY;
            break;
        }
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING */

        /* Validate BLE config for Sidewalk */
        if (cfg->conn_param.min_conn_interval < SID_BLE_SPEC_CONN_INTERVAL_MIN)
        {
            SID_PAL_LOG_ERROR("Invalid Sidewalk BLE config. Min connection interval is below the Sidewalk specification");
            err = SID_ERROR_PARAM_OUT_OF_RANGE;
            break;
        }
        if (cfg->conn_param.max_conn_interval > SID_BLE_SPEC_CONN_INTERVAL_MAX)
        {
            SID_PAL_LOG_ERROR("Invalid Sidewalk BLE config. Mac connection interval is above the Sidewalk specification");
            err = SID_ERROR_PARAM_OUT_OF_RANGE;
            break;
        }
        if (cfg->conn_param.conn_sup_timeout < sid_stm32wba_ble_adapter_util_calc_min_conn_timeout(cfg->conn_param.max_conn_interval, cfg->conn_param.slave_latency))
        {
            SID_PAL_LOG_ERROR("Invalid Sidewalk BLE config. Connection supervision timeout is too short for given latency and interval");
            err = SID_ERROR_PARAM_OUT_OF_RANGE;
            break;
        }

        /* Invalidate AMA Inbox buffer */
        sid_ble_sidewalk_ctx.ama_ctx.inbox_valid_length = 0u;

        /* Do the generic BLE stack init */
        err = sid_stm32wba_ble_adapter_prv_generic_init(init_type, cfg);
        if (err != SID_ERROR_NONE)
        {
            /* Logs are provided by sid_stm32wba_ble_adapter_prv_generic_init() */
            break;
        }

        SID_PAL_LOG_INFO("Sidewalk BLE max ATT MTU: %u bytes", sid_ble_drv_ctx.cfg->sidewalk_profile.max_att_mtu);

        /* Initialize the associated RTOS resources for Sidewalk GATT profile */
        if ((ama_sendout_queue != NULL) || (ama_sendout_task != NULL))
        {
            err = SID_ERROR_ALREADY_INITIALIZED;
            break;
        }
        ama_sendout_queue = osMessageQueueNew(SIDEWALK_BLE_AMA_SEND_OUT_MSG_QUEUE_LEN, sizeof(AMAMessageQueueElement_t), &ama_sendout_queue_attributes);
        ama_sendout_task = osThreadNew(_ble_adapter_sidewalk_ama_process_send_out, NULL, &ama_sendout_task_attributes);
        if ((NULL == ama_sendout_queue) || (NULL == ama_sendout_task))
        {
            err = SID_ERROR_OOM;
            break;
        }

        /* Set advertisement parameters - this will create an extended advertisement set for Sidewalk (if used) */
        err = _ble_adapter_sidewalk_set_adv_params(sid_ble_sidewalk_ctx.ble_cfg->adv_param.fast_interval);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_sidewalk_set_adv_params() */
            break;
        }

        /* Add Sidewalk GATT profile */
        err = _ble_adapter_sidewalk_services_init(sid_ble_sidewalk_ctx.ble_cfg);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_sidewalk_services_init() */
            break;
        }

        SID_PAL_LOG_INFO("Sidewalk BLE init done");
        sid_ble_sidewalk_ctx.init_done = TRUE;
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    if (ll_lock_acquired != FALSE)
    {
        os_status = osMutexRelease(LinkLayerMutex);
        if (os_status != osOK)
        {
            SID_PAL_LOG_ERROR("Failed to release BLE LL mutex. BLE stack will be blocked till reset");
            err = SID_ERROR_UNRECOVERABLE;
        }
    }

