stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
    /* Release any partially allocated resources if the initialization has failed */
    if (err != SID_ERROR_NONE)
    {
        (void)_ble_adapter_sidewalk_deinit();
    }

    SID_BLE_SIDEWALK_LOG_DEBUG("==>> End ble_adapter_sidewalk_init function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_start_service(void)
{
    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_error_t _ble_adapter_sidewalk_set_adv_params(const uint32_t adv_interval)
{
    sid_error_t       err;
    tBleStatus        ble_status;
    const uint32_t    adv_interval_min = adv_interval - SID_STM32_BLE_MS_TO_ADV_INTERVAL_UNITS(((float)(SID_STM32_BLE_SIDEWALK_ADV_WINDOW_MS) / 2.f));
    const uint32_t    adv_interval_max = adv_interval + SID_STM32_BLE_MS_TO_ADV_INTERVAL_UNITS(((float)(SID_STM32_BLE_SIDEWALK_ADV_WINDOW_MS) / 2.f));

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
    SID_PAL_ASSERT(adv_interval > SID_BLE_HCI_EXTENDED_ADV_INTERVAL_MIN);
    SID_PAL_ASSERT(adv_interval < SID_BLE_HCI_EXTENDED_ADV_INTERVAL_MAX);
    SID_PAL_ASSERT(adv_interval_min >= SID_BLE_HCI_EXTENDED_ADV_INTERVAL_MIN);
    SID_PAL_ASSERT(adv_interval_max <= SID_BLE_HCI_EXTENDED_ADV_INTERVAL_MAX);
#else
    SID_PAL_ASSERT(adv_interval > SID_BLE_HCI_ADV_INTERVAL_MIN);
    SID_PAL_ASSERT(adv_interval < SID_BLE_HCI_ADV_INTERVAL_MAX);
    SID_PAL_ASSERT(adv_interval_min >= SID_BLE_HCI_ADV_INTERVAL_MIN);
    SID_PAL_ASSERT(adv_interval_max <= SID_BLE_HCI_ADV_INTERVAL_MAX);
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */
    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.ble_cfg != NULL);

    do
    {
        uint8_t own_addr_type = sid_stm32wba_ble_adapter_util_convert_sid_ble_addr_type_to_hci_own_adv_addr_type(sid_ble_sidewalk_ctx.ble_cfg->mac_addr_type);

        /* Configure Identity Address for RPA */
        uint8_t                          ia_addr_type;
        sid_pal_ble_prv_bt_addr_buffer_t ia_addr;

#if SID_STM32_BLE_USE_RANDOM_IDENTITY_ADDRESS
        ia_addr_type = SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RANDOM;
        err = sid_stm32wba_ble_adapter_util_get_host_static_random_addr(&ia_addr);
#else
        ia_addr_type = SID_BLE_HCI_ADV_PEER_ADDR_TYPE_PUBLIC;
        err = sid_stm32wba_ble_adapter_util_get_host_public_addr(&ia_addr);
#endif /* SID_STM32_BLE_USE_RANDOM_IDENTITY_ADDRESS */
        if (err != SID_ERROR_NONE)
        {
            break;
        }

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        int8_t selected_adv_tx_pwr;

        /* Configure extended advertisement set for Sidewalk */
        ble_status = hci_le_set_extended_advertising_parameters(
                        sid_ble_sidewalk_ctx.adv_set.Advertising_Handle,
                        SID_STM32_BLE_LEGACY_ADV_TYPE_TO_EXT_ADV_EVT_PROPS(HCI_ADV_TYPE_ADV_IND), /* Sidewalk requires legacy advertisement PDU */
                        (uint8_t *)(void *)&adv_interval_min,
                        (uint8_t *)(void *)&adv_interval_max,
                        (ADV_CH_37 | ADV_CH_38 | ADV_CH_39),                    /* Use all channels for advertisement */
                        own_addr_type,                                          /* Typically a non-resolvable private address is used for Sidewalk advertisement, but allow the user to override this */
                        ia_addr_type,                                           /* Point to local host peer address for RPA, unused for other host address types */
                        (uint8_t *)ia_addr.bytes,                               /* Point to local host peer address for RPA, unused for other host address types */
                        HCI_ADV_FILTER_NO,                                      /* Don't use any filters for Sidewalk connections */
                        127u,                                                   /* Tx power preference - no preference */
                        HCI_PRIMARY_ADV_PHY_LE_1M,
                        0x00u,                                                  /* Secondary_Advertising_Max_Skip - irrelevant for legacy Adv PDU */
                        HCI_TX_PHY_LE_2M,                                       /* Secondary advertisement PHY - irrelevant for legacy Adv PDU */
                        0x00u,                                                  /* Advertising_SID - irrelevant for legacy Adv PDU */
                        0x01u,                                                  /* Scan request notifications enabled */
                        (uint8_t *)&selected_adv_tx_pwr);                       /* Advertisement Tx power selected by the Host Controller */
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("==>> hci_le_set_extended_advertising_parameters - fail, result: 0x%02X, set: 0x%02X", ble_status, sid_ble_sidewalk_ctx.adv_set.Advertising_Handle);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        else
        {
            SID_BLE_SIDEWALK_LOG_DEBUG("==>> hci_le_set_extended_advertising_parameters - Success, set: 0x%02X, Tx power: %s%ddBm", sid_ble_sidewalk_ctx.adv_set.Advertising_Handle, selected_adv_tx_pwr > 0 ? "+" : "", selected_adv_tx_pwr);
            err = SID_ERROR_NONE;
        }
#else
        ble_status = hci_le_set_advertising_parameters(
                        (uint16_t)adv_interval_min,
                        (uint16_t)adv_interval_max,
                        HCI_ADV_TYPE_ADV_IND,
                        own_addr_type,                                          /* Typically a non-resolvable private address is used for Sidewalk advertisement, but allow the user to override this */
                        ia_addr_type,                                           /* Point to local host peer address for RPA, unused for other host address types */
                        (uint8_t *)ia_addr.bytes,                               /* Point to local host peer address for RPA, unused for other host address types */
                        (ADV_CH_37 | ADV_CH_38 | ADV_CH_39),                    /* Use all channels for advertisement */
                        HCI_ADV_FILTER_NO);                                     /* Don't use any filters for Sidewalk connections */
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("==>> hci_le_set_advertising_parameters - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        else
        {
            SID_BLE_SIDEWALK_LOG_DEBUG("==>> hci_le_set_advertising_parameters - Success");
            err = SID_ERROR_NONE;
        }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */
    } while (0);

