stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_set_adv_data(uint8_t * mfg_data, uint8_t mfg_length)
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus  ble_status;

    SID_PAL_ASSERT(sid_ble_drv_ctx.cfg != NULL);
    SID_PAL_ASSERT(sid_ble_drv_ctx.cfg->sidewalk_profile.device_name != NULL);

    do
    {
        uint8_t adv_bin_data[SID_STM32_BLE_MAX_ADVERTISING_BUFFER_SIZE];
        uint8_t sr_bin_data[SID_STM32_BLE_MAX_ADVERTISING_BUFFER_SIZE];

        /* Validate inputs */
        if (SID_STM32_BLE_HANDLE_INVALID_VALUE == sid_ble_sidewalk_ctx.ama_ctx.service_context.service_handle)
        {
            err = SID_ERROR_UNINITIALIZED;
            break;
        }

        /* Cleanup any previous data */
        SID_STM32_UTIL_fast_memset(adv_bin_data, 0u, sizeof(adv_bin_data));
        SID_STM32_UTIL_fast_memset(sr_bin_data, 0u, sizeof(sr_bin_data));

        /* Build advertisement data */
        uint32_t adv_pos = 0u;

        /* Add advertisement flags */
        adv_bin_data[adv_pos] = SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + SID_BLE_HCI_ADV_FLAGS_RECORD_SIZE;
        adv_pos += SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE;
        adv_bin_data[adv_pos] = AD_TYPE_FLAGS;
        adv_pos += SID_BLE_HCI_ADV_TYPE_RECORD_SIZE;
        adv_bin_data[adv_pos] = (FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE | FLAG_BIT_BR_EDR_NOT_SUPPORTED);
        adv_pos += SID_BLE_HCI_ADV_FLAGS_RECORD_SIZE;

        /* Add AMA service UUID */
        uint8_t stm_uuid_type;
        Service_UUID_t stm_uuid;

        /* Convert from Sidewalk SDK format to STM32 WPAN format */
        err = sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_svc_uuid(&stm_uuid_type, &stm_uuid, &(sid_ble_sidewalk_ctx.ama_ctx.service_context.service_info.id));
        if (err != SID_ERROR_NONE)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("  Fail   : sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_svc_uuid command, error code: %d", (int32_t)err);
            break;
        }

        /* Add converted data to the buffer */
        if (STM32_WPAN_BLE_UUID_TYPE_16 == stm_uuid_type)
        {
            adv_bin_data[adv_pos] = SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + sizeof(stm_uuid.Service_UUID_16);
            adv_pos += SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE;
            adv_bin_data[adv_pos] = AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST;
            adv_pos += SID_BLE_HCI_ADV_TYPE_RECORD_SIZE;
            SID_STM32_UTIL_fast_memcpy(&adv_bin_data[adv_pos], &stm_uuid.Service_UUID_16, sizeof(stm_uuid.Service_UUID_16));
            adv_pos += sizeof(stm_uuid.Service_UUID_16);
        }
        else if (STM32_WPAN_BLE_UUID_TYPE_128 == stm_uuid_type)
        {
            adv_bin_data[adv_pos] = SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + sizeof(stm_uuid.Service_UUID_128);
            adv_pos += SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE;
            adv_bin_data[adv_pos] = AD_TYPE_128_BIT_SERV_UUID;
            adv_pos += SID_BLE_HCI_ADV_TYPE_RECORD_SIZE;
            SID_STM32_UTIL_fast_memcpy(&adv_bin_data[adv_pos], &stm_uuid.Service_UUID_128, sizeof(stm_uuid.Service_UUID_128));
            adv_pos += sizeof(stm_uuid.Service_UUID_128);
        }
        else
        {
            SID_PAL_LOG_ERROR("  Fail   : Unsupported UUID type for advertisement");
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Add manufacturing data supplied by Sidewalk stack */
        adv_bin_data[adv_pos] = SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + SID_BLE_HCI_ADV_MFG_DATA_MANUFACTURER_ID_LENGTH + mfg_length;
        adv_pos += SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE;
        adv_bin_data[adv_pos] = AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
        adv_pos += SID_BLE_HCI_ADV_TYPE_RECORD_SIZE;
        adv_bin_data[adv_pos] = (uint8_t)(SID_BLE_AMAZON_COMPANY_ID & 0xFFu);
        adv_bin_data[adv_pos + 1] = (uint8_t)((SID_BLE_AMAZON_COMPANY_ID >> 8) & 0xFFu);
        adv_pos += SID_BLE_HCI_ADV_MFG_DATA_MANUFACTURER_ID_LENGTH;
        if ((mfg_data != NULL) && (mfg_length > 0u))
        {
            SID_STM32_UTIL_fast_memcpy(&adv_bin_data[adv_pos], mfg_data, mfg_length);
            adv_pos += mfg_length;
        }

        SID_PAL_ASSERT(adv_pos <= MAX_ADV_DATA_LEN);

        /* Build scan response data and put the Sidewalk device name there */
        uint32_t sr_pos = 0u;

        const uint32_t name_len = strlen(sid_ble_drv_ctx.cfg->sidewalk_profile.device_name);
        sr_bin_data[sr_pos] = SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + name_len;
        sr_pos += SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE;
        sr_bin_data[sr_pos] = AD_TYPE_COMPLETE_LOCAL_NAME;
        sr_pos += SID_BLE_HCI_ADV_TYPE_RECORD_SIZE;
        SID_STM32_UTIL_fast_memcpy(&sr_bin_data[sr_pos], sid_ble_drv_ctx.cfg->sidewalk_profile.device_name, name_len);
        sr_pos += name_len;

        SID_PAL_ASSERT(sr_pos <= MAX_ADV_DATA_LEN);

        /* Put advertisement data into the host controller */
#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        ble_status = hci_le_set_extended_advertising_data(sid_ble_sidewalk_ctx.adv_set.Advertising_Handle,
                                                          HCI_SET_ADV_DATA_OPERATION_COMPLETE,
                                                          SID_BLE_HCI_SET_ADV_DATA_FRAGMENT_PREF_NO_FRAGMENT,
                                                          sizeof(adv_bin_data), (uint8_t *)adv_bin_data);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("==>> hci_le_set_extended_advertising_data - fail, result: 0x%02X, set: 0x%02X", ble_status, sid_ble_sidewalk_ctx.adv_set.Advertising_Handle);
            err = SID_BLE_HCI_STATUS_UNKNOWN_ADV_IDENTIFIER == ble_status ? SID_ERROR_UNINITIALIZED : SID_ERROR_IO_ERROR; /* Advertisement set shall be created first via calling hci_le_set_extended_advertising_parameters */
            break;
        }
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> Success: hci_le_set_extended_advertising_data, set: 0x%02X", sid_ble_sidewalk_ctx.adv_set.Advertising_Handle);
#else
        /* Use legacy advertisement API */
        ble_status = hci_le_set_advertising_data(adv_pos, (uint8_t *)adv_bin_data);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("==>> hci_le_set_advertising_data - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> Success: hci_le_set_advertising_data");
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("==>> hci_le_set_scan_response_data - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> hci_le_set_scan_response_data - Success");

        /* Put scan response data into the host controller */
#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        ble_status = hci_le_set_extended_scan_response_data(sid_ble_sidewalk_ctx.adv_set.Advertising_Handle,
                                                            HCI_SET_ADV_DATA_OPERATION_COMPLETE,
                                                            SID_BLE_HCI_SET_ADV_DATA_FRAGMENT_PREF_NO_FRAGMENT,
                                                            sizeof(sr_bin_data), (uint8_t *)sr_bin_data);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("==>> hci_le_set_extended_scan_response_data - fail, result: 0x%02X, set: 0x%02X", ble_status, sid_ble_sidewalk_ctx.adv_set.Advertising_Handle);
            err = SID_BLE_HCI_STATUS_UNKNOWN_ADV_IDENTIFIER == ble_status ? SID_ERROR_UNINITIALIZED : SID_ERROR_IO_ERROR; /* Advertisement set shall be created first via calling hci_le_set_extended_advertising_parameters */
            break;
        }
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> Success: hci_le_set_extended_scan_response_data, set: 0x%02X", sid_ble_sidewalk_ctx.adv_set.Advertising_Handle);
#else
        /* Use legacy scan response API */
        ble_status = hci_le_set_scan_response_data(sr_pos, (uint8_t*)sr_bin_data);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("==>> hci_le_set_scan_response_data - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> hci_le_set_scan_response_data - Success");
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

