stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_start_advertisement(void)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        sid_pal_ble_prv_adv_state_t new_adv_state;
        uint32_t                    adv_interval;

        SID_PAL_ASSERT(sid_ble_sidewalk_ctx.ble_cfg != NULL);

        sid_pal_enter_critical_region();
        err = SID_ERROR_NONE;

        /* Validate inputs */
        if (SID_STM32_BLE_HANDLE_INVALID_VALUE == sid_ble_sidewalk_ctx.ama_ctx.service_context.service_handle)
        {
            SID_PAL_LOG_ERROR("Sidewalk BLE advertisement request discarded - GATT is not initialized")
            err = SID_ERROR_UNINITIALIZED;
            /* Don't terminate yet */
        }

        /* Validate Sidewalk connection state */
        if (sid_ble_sidewalk_ctx.conn_ctx != NULL)
        {
            SID_PAL_LOG_WARNING("Sidewalk BLE advertisement request discarded - active Sidewalk connection present, handle: 0x%04X", sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id);
            err = SID_ERROR_INVALID_STATE;
            /* Don't terminate yet */
        }

        if (sid_ble_sidewalk_ctx.advertising_state != BADVS_ADVERTISEMENT_OFF)
        {
            SID_PAL_LOG_WARNING("Sidewalk BLE advertisement request discarded - advertising already");
            err = SID_ERROR_INVALID_STATE;
            /* Don't terminate yet */
        }
        sid_pal_exit_critical_region();

        /* Terminate if pre-launch validations failed */
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        if (sid_ble_sidewalk_ctx.ble_cfg->adv_param.fast_enabled != FALSE)
        {
            new_adv_state                         = BADVS_ADVERTISEMENT_FAST;
            adv_interval                          = sid_ble_sidewalk_ctx.ble_cfg->adv_param.fast_interval;
            sid_ble_sidewalk_ctx.adv_set.Duration = sid_ble_sidewalk_ctx.ble_cfg->adv_param.fast_timeout;
        }
        else if (sid_ble_sidewalk_ctx.ble_cfg->adv_param.slow_enabled != FALSE)
        {
            new_adv_state                         = BADVS_ADVERTISEMENT_SLOW;
            adv_interval                          = sid_ble_sidewalk_ctx.ble_cfg->adv_param.slow_interval;
            sid_ble_sidewalk_ctx.adv_set.Duration = sid_ble_sidewalk_ctx.ble_cfg->adv_param.slow_timeout;
        }
        else
        {
            SID_PAL_LOG_ERROR("Cannot start advertisement. Both fast and slow modes are disabled in configuration");
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Set advertisement parameters */
        err = _ble_adapter_sidewalk_set_adv_params(adv_interval);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_sidewalk_set_adv_params() */
            break;
        }

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        /* Update random address if required */
        if (SID_BLE_CFG_MAC_ADDRESS_TYPE_PUBLIC != sid_ble_sidewalk_ctx.ble_cfg->mac_addr_type)
        {
            sid_pal_ble_prv_bt_addr_buffer_t adv_bd_addr;

            switch (sid_ble_sidewalk_ctx.ble_cfg->mac_addr_type)
            {
                case SID_BLE_CFG_MAC_ADDRESS_TYPE_STATIC_RANDOM:
                    /* Load static random address for this device */
                    err = sid_stm32wba_ble_adapter_util_get_host_static_random_addr(&adv_bd_addr);
                    break;

                case SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_RESOLVABLE:
                case SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
                default:
                    /* Generate a unique private random non-resolvable address for advertisement set. If RPA is used, this NRPA will be a back up address */
                    err = sid_stm32wba_ble_adapter_util_generate_private_nonresolvable_random_mac_address(&adv_bd_addr);
                    break;
            }

            if (err != SID_ERROR_NONE)
            {
                SID_PAL_LOG_ERROR("  Fail   : Unable to set random device address, error code: %d", (int32_t)err);
                break;
            }

            /* Set address to be used by advertisement set */
            tBleStatus ble_status = hci_le_set_advertising_set_random_address(sid_ble_sidewalk_ctx.adv_set.Advertising_Handle, (uint8_t *)adv_bd_addr.bytes);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                SID_PAL_LOG_ERROR("==>> hci_le_set_advertising_set_random_address - fail, result: 0x%02X, set: 0x%02X", ble_status, sid_ble_sidewalk_ctx.adv_set.Advertising_Handle);
                err = SID_ERROR_IO_ERROR;
                break;
            }
            SID_BLE_SIDEWALK_LOG_DEBUG("==>> hci_le_set_advertising_set_random_address - Success, set: 0x%02X", sid_ble_sidewalk_ctx.adv_set.Advertising_Handle);
            SID_BLE_SIDEWALK_LOG_DEBUG("   Random Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x", adv_bd_addr.bytes[5],
                                                                                                     adv_bd_addr.bytes[4],
                                                                                                     adv_bd_addr.bytes[3],
                                                                                                     adv_bd_addr.bytes[2],
                                                                                                     adv_bd_addr.bytes[1],
                                                                                                     adv_bd_addr.bytes[0]);
        }
#else
        /* Update random address if required */
        if (SID_BLE_CFG_MAC_ADDRESS_TYPE_PUBLIC != sid_ble_sidewalk_ctx.ble_cfg->mac_addr_type)
        {
            err = sid_stm32wba_ble_adapter_prv_rotate_random_mac_address(NULL, sid_ble_sidewalk_ctx.ble_cfg->mac_addr_type);
            if (err != SID_ERROR_NONE)
            {
                SID_BLE_SIDEWALK_LOG_ERROR("  Fail   : unable to rotate BLE random address, error %d", (int32_t)err);
                break;
            }
            SID_BLE_SIDEWALK_LOG_DEBUG("  Success: rotate_random_mac_address");
        }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /* Start advertising */
        err = sid_stm32wba_ble_adapter_prv_generic_start_advertisement(&sid_ble_sidewalk_ctx.adv_set);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by sid_stm32wba_ble_adapter_prv_generic_start_advertisement */
            break;
        }

        /* Indicate that we are advertising */
        sid_ble_sidewalk_ctx.advertising_state = new_adv_state;

        SID_PAL_LOG_INFO("Sidewalk BLE advertisement started in %s mode", BADVS_ADVERTISEMENT_FAST == new_adv_state ? "fast" : "slow");
    } while (0);

