stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_stop_advertisement(void)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        if (BADVS_ADVERTISEMENT_OFF == sid_ble_sidewalk_ctx.advertising_state)
        {
            /* Advertising is not active */
            err = SID_ERROR_NONE;
            break;
        }

        err = sid_stm32wba_ble_adapter_prv_generic_stop_advertisement(sid_ble_sidewalk_ctx.adv_set.Advertising_Handle);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Advertisement is stopped */
        sid_ble_sidewalk_ctx.advertising_state = BADVS_ADVERTISEMENT_OFF;
#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0)
        if (osThreadGetId() != sid_ble_drv_ctx.advertising_cmd_task)
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */
        {
            SID_PAL_LOG_INFO("Sidewalk BLE advertisement stopped on request");
        }

        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_get_rssi(int8_t * rssi)
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus ble_status;
    int8_t raw_rssi;

    SID_PAL_ASSERT(rssi != NULL);

    do
    {
        uint16_t conn_handle = SID_STM32_BLE_HANDLE_INVALID_VALUE;

        sid_pal_enter_critical_region();
        if (sid_ble_sidewalk_ctx.conn_ctx != NULL)
        {
            /* Store a local copy of the connection handle because sid_ble_sidewalk_ctx.conn_ctx can be modified asynchronously at any point */
            conn_handle = sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id;
        }
        sid_pal_exit_critical_region();

        if (SID_STM32_BLE_HANDLE_INVALID_VALUE == conn_handle)
        {
            err = SID_ERROR_PORT_NOT_OPEN;
            break;
        }

        /* Read last known RSSI for Sidewalk connection */
        ble_status = hci_read_rssi(conn_handle, (uint8_t *)&raw_rssi);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            err = SID_ERROR_IO_ERROR;
            break;
        }

        /* Check RSSI raw value is valid */
        if (SID_BLE_HCI_INVALID_RSSI_VALUE == raw_rssi)
        {
            /* RSSI value cannot be read from HCI */
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Process raw value */
        *rssi = raw_rssi; /* If raw RSSI is valid it's already in dBm units and can be used directly */
        err = SID_ERROR_NONE;
    } while (0);

    if (err != SID_ERROR_NONE)
    {
        /* Set RSSI to invalid value for any reported error */
        *rssi = (int8_t)SID_BLE_HCI_INVALID_RSSI_VALUE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_get_tx_pwr(int8_t * tx_power)
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus ble_status;
    int8_t current_pwr;

    do
    {
        uint16_t conn_handle = SID_STM32_BLE_HANDLE_INVALID_VALUE;

        sid_pal_enter_critical_region();
        if (sid_ble_sidewalk_ctx.conn_ctx != NULL)
        {
            /* Store a local copy of the connection handle because sid_ble_sidewalk_ctx.conn_ctx can be modified asynchronously at any point */
            conn_handle = sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id;
        }
        sid_pal_exit_critical_region();

        if (SID_STM32_BLE_HANDLE_INVALID_VALUE == conn_handle)
        {
            err = SID_ERROR_PORT_NOT_OPEN;
            break;
        }

        ble_status = hci_read_transmit_power_level(conn_handle, 0x00u, (uint8_t *)&current_pwr);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("Failed to read current tx power 0x%x", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }

        SID_PAL_LOG_WARNING("Current Sidewalk Tx pwr: %d", (int8_t)current_pwr);
        *tx_power = current_pwr;
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_send_data(sid_ble_cfg_service_identifier_t id, uint8_t * data, uint16_t length)
{
    sid_error_t err = SID_ERROR_GENERIC;

    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks != NULL);
    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks->ind_callback != NULL);

    do
    {
        /* Ensure there's a valid connection */
        if (NULL == sid_ble_sidewalk_ctx.conn_ctx)
        {
            /* There's no active BLE connection */
            err = SID_ERROR_PORT_NOT_OPEN;
            break;
        }

        /* Validate inputs */
        if ((NULL == data) || (0u == length) || (length > SID_STM32_BLE_ATT_LEN_LIMIT(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.mtu_size)))
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        switch (id)
        {
            case AMA_SERVICE:
                {
                    /* Ensure proper state */
                    if ((NULL == sid_ble_sidewalk_ctx.conn_ctx)
                     || (FALSE == sid_ble_sidewalk_ctx.ama_ctx.is_notification_enabled)
                     || (SID_STM32_BLE_HANDLE_INVALID_VALUE == sid_ble_sidewalk_ctx.ama_ctx.service_context.service_handle)
                     || (SID_STM32_BLE_HANDLE_INVALID_VALUE == sid_ble_sidewalk_ctx.ama_ctx.outbox_char_handle))
                    {
                        err = SID_ERROR_PORT_NOT_OPEN;
                        break;
                    }

                    /* Allocate RAM buffer to temporarily store characteristic data */
                    uint8_t * databuf = (uint8_t *)malloc(length);
                    if (NULL == databuf)
                    {
                        err = SID_ERROR_OOM;
                        break;
                    }
                    SID_STM32_UTIL_fast_memcpy(databuf, data, length);

