stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
                    /* Enqueue characteristic data */
                    AMAMessageQueueElement_t msg_descriptor = {
                        .data   = databuf,
                        .length = length,
                    };
                    osStatus_t enqueue_status = osMessageQueuePut(ama_sendout_queue, &msg_descriptor, osPriorityNone, 0u);
                    if (enqueue_status != osOK)
                    {
                        SID_PAL_LOG_ERROR("==>> Unable to enqueue %d bytes message into AMA Send Out queue. Message will be lost", length);
                        free(databuf);

                        /* Notify Sidewalk stack about the failure */
                        sid_ble_sidewalk_ctx.event_callbacks->ind_callback(FALSE);

                        err = SID_ERROR_IO_ERROR;
                        break;
                    }

                    /* Done */
                    SID_PAL_LOG_DEBUG("==>> Successfully enqueued %d bytes message into AMA Send Out queue", length);
                    err = SID_ERROR_NONE;
                }
                break;

            case VENDOR_SERVICE:
                SID_PAL_LOG_ERROR("Vendor GATT services are not supported by this Sidewalk driver");
                err = SID_ERROR_NOSUPPORT;
                break;

            case LOGGING_SERVICE:
                SID_PAL_LOG_ERROR("Logging GATT service is not supported by this Sidewalk driver");
                err = SID_ERROR_NOSUPPORT;
                break;

            default:
                SID_PAL_LOG_ERROR("Unknown Sidewalk BLE service id: %u", (uint32_t)id);
                err = SID_ERROR_INVALID_ARGS;
                break;
        }

        /* Check if service-specific processing ended with an error */
        if (err != SID_ERROR_NONE)
        {
            if (AMA_SERVICE == id)
            {
                SID_PAL_LOG_ERROR("==>> Failed to write data to AMA Outbox. Error code: %d", (int32_t)err);
            }
            break;
        }

        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_set_callbacks(const sid_pal_ble_adapter_callbacks_t * cb)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Validate inputs */
        if (NULL == cb)
        {
            err = SID_ERROR_NULL_POINTER;
            break;
        }

        if ((NULL == cb->data_callback)
         || (NULL == cb->notify_callback)
         || (NULL == cb->conn_callback)
         || (NULL == cb->ind_callback)
         || (NULL == cb->mtu_callback)
         || (NULL == cb->adv_start_callback))
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Set new callbacks */
        sid_pal_enter_critical_region();
        sid_ble_sidewalk_ctx.event_callbacks = cb;
        sid_pal_exit_critical_region();

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_set_tx_pwr(int8_t tx_power)
{
    // TODO: implement
    return SID_ERROR_NOSUPPORT;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_sidewalk_disconnect(void)
{
    sid_error_t  err = SID_ERROR_GENERIC;
    tBleStatus   ble_status;

    /**
     * Store pointer to the connection context storage since sid_ble_sidewalk_ctx.conn_ctx can be invalidated right after aci_gap_terminate()
     * before sid_stm32wba_ble_adapter_prv_gap_cmd_resp_wait() is reached
     */
    const sid_pal_ble_prv_connection_ctx_t * const tmp_conn_ctx = sid_ble_sidewalk_ctx.conn_ctx;

    sid_pal_enter_critical_region();
    do
    {
        /* Validate state */
        if (SID_STM32_BLE_HANDLE_INVALID_VALUE == sid_ble_sidewalk_ctx.ama_ctx.service_context.service_handle)
        {
            err = SID_ERROR_UNINITIALIZED;
            break;
        }

        if (NULL == sid_ble_sidewalk_ctx.conn_ctx)
        {
            /* Already disconnected */
            err = SID_ERROR_PORT_NOT_OPEN;
            break;
        }

        /* Prepare to wait for disconnection completion */
        sid_stm32wba_ble_adapter_prv_gap_cmd_arm_resp_wait(sid_ble_sidewalk_ctx.conn_ctx);

        /* Initiate disconnect */
        ble_status = aci_gap_terminate(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("==>> aci_gap_terminate - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> aci_gap_terminate - Success");

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);
    sid_pal_exit_critical_region();

    if (SID_ERROR_NONE == err)
    {
        /* Wait for disconnect to complete */
        err = sid_stm32wba_ble_adapter_prv_gap_cmd_resp_wait(tmp_conn_ctx);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to wait for Sidewalk BLE disconnect completion. Error %d", (int32_t)err);
        }
    }

    /* For Sidewalk stack invoking this method if there's no active connection is not an error */
    if (SID_ERROR_PORT_NOT_OPEN == err)
    {
        err = SID_ERROR_NONE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

static sid_error_t _ble_adapter_sidewalk_deinit(void)
{
    sid_error_t err;
    sid_error_t gatt_deinit_err;
    sid_error_t rtos_resource_deinit_err;
    sid_error_t generic_deinit_err;
    osStatus_t  os_status;
    uint32_t    ll_lock_acquired;

    SID_BLE_SIDEWALK_LOG_DEBUG("==>> Start ble_adapter_sidewalk_deinit function");

    /* Trigger disconnect. We don't care if there's anything connected or if this call will succeed */
    (void)_ble_adapter_sidewalk_disconnect();

    /* Wait for any potentially ongoing BLE operations to stop */
    os_status = osMutexAcquire(LinkLayerMutex, SID_STM32_BLE_LL_MUTEX_WAIT_TIMEOUT_ON_DEINIT_TICKS);

