stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
    /* Print out warning but proceed */
    if (os_status != osOK)
    {
        SID_PAL_LOG_WARNING("Failed to acquire BLE LL mutex, race conditions are possible during Sidewalk BLE deinit");
        ll_lock_acquired = FALSE;
    }
    else
    {
        ll_lock_acquired = TRUE;
    }

    /*----------------------------------------------------------------------------*/

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
    /* Delete Sidewalk advertisement set */
    tBleStatus ble_status = hci_le_remove_advertising_set(sid_ble_sidewalk_ctx.adv_set.Advertising_Handle);
    if (ble_status != BLE_STATUS_SUCCESS)
    {
        SID_PAL_LOG_WARNING("Failed to remove Sidewalk advertising set. Status 0x%02X", ble_status);
    }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

    /* Clean up AMA GATT service resources - this will also render AMA service unusable, preventing any further connections to it */
    gatt_deinit_err = _ble_adapter_sidewalk_services_deinit();
    if (gatt_deinit_err != SID_ERROR_NONE)
    {
        SID_PAL_LOG_WARNING("Failed to deinitialize Sidewalk BLE GATT. Memory leak is possible");
    }

    /*----------------------------------------------------------------------------*/

    /* Now it is safe to deinitialize the associated RTOS resources */
    rtos_resource_deinit_err = SID_ERROR_NONE;

    if (ama_sendout_task != NULL)
    {
        os_status = osThreadTerminate(ama_sendout_task);
        ama_sendout_task = NULL;
        if (os_status != osOK)
        {
            SID_PAL_LOG_ERROR("Failed to terminate Sidewalk AMA Thread. Error 0x%08X", (uint32_t)os_status);
            rtos_resource_deinit_err = SID_ERROR_UNINITIALIZED;
            /* Continue deinitialization because we still need to deallocate the other resources */
        }
    }

    if (ama_sendout_queue != NULL)
    {
        os_status = osMessageQueueDelete(ama_sendout_queue);
        ama_sendout_queue = NULL;
        if (os_status != osOK)
        {
            SID_PAL_LOG_ERROR("Failed to delete Sidewalk AMA Message Queue. Error 0x%08X", (uint32_t)os_status);
            rtos_resource_deinit_err = SID_ERROR_UNINITIALIZED;
            /* Continue deinitialization because we still need to deallocate the other resources */
        }
    }

    if (rtos_resource_deinit_err != SID_ERROR_NONE)
    {
        SID_PAL_LOG_WARNING("Failed to deinitialize Sidewalk BLE RTOS resources. Memory leak is possible");
    }

    /*----------------------------------------------------------------------------*/

    generic_deinit_err = sid_stm32wba_ble_adapter_prv_generic_deinit();
    /* Logs provided by sid_stm32wba_ble_adapter_prv_generic_deinit */

    /* Release LL lock */
    if ((ll_lock_acquired != FALSE) && (LinkLayerMutex != NULL))
    {
        os_status = osMutexRelease(LinkLayerMutex);
        if (os_status != osOK)
        {
            SID_PAL_LOG_ERROR("Failed to release BLE LL mutex. BLE stack will be blocked till reset");
            rtos_resource_deinit_err = SID_ERROR_UNRECOVERABLE;
        }
    }

    /**
     * Select error with following priorities (highest to lowest)
     * 1. Generic deinitialization errors
     * 2. BLE GATT deinit errors
     * 3. RTOS resource deallocation errors
     */
    err = generic_deinit_err != SID_ERROR_NONE ? generic_deinit_err : (gatt_deinit_err != SID_ERROR_NONE ? gatt_deinit_err : rtos_resource_deinit_err);

    sid_ble_sidewalk_ctx.init_done = FALSE;

    SID_BLE_SIDEWALK_LOG_DEBUG("==>> End ble_adapter_sidewalk_deinit function");

    return err;
}

/* Private shared function definitions ---------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_ble_adapter_create(sid_pal_ble_adapter_interface_t * handle)
{
    sid_error_t err = SID_ERROR_GENERIC;

    /**
     * WARNING: This method is intended to be used by the Sidewalk stack only. Using it in the user application
     *          directly may result in undefined behavior.
     * 
     */

    do
    {
        if (NULL == handle)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        *handle = (sid_pal_ble_adapter_interface_t)&sidwalk_ble_ifc;
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_sidewalk_on_adv_timeout(void)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Check if restart is needed */
        if ((BADVS_ADVERTISEMENT_FAST == sid_ble_sidewalk_ctx.advertising_state) && (sid_ble_sidewalk_ctx.ble_cfg->adv_param.slow_enabled != FALSE))
        {
            /* Fast advertisement timed out and slow advertisement is allowed - proceed with slow advertisement */

            /* Indicate the advertisement is stopped in case restart will fail */
            sid_ble_sidewalk_ctx.advertising_state = BADVS_ADVERTISEMENT_OFF;

            /* Update advertisement duration */
            sid_ble_sidewalk_ctx.adv_set.Duration = sid_ble_sidewalk_ctx.ble_cfg->adv_param.slow_timeout;

            /* Apply advertisement parameters for slow advertisement */
            err = _ble_adapter_sidewalk_set_adv_params(sid_ble_sidewalk_ctx.ble_cfg->adv_param.slow_interval);
            if (err != SID_ERROR_NONE)
            {
                /* Logs provided by _ble_adapter_sidewalk_set_adv_params() */
                break;
            }

            /* Restart advertisement */
            err = sid_stm32wba_ble_adapter_prv_generic_start_advertisement(&sid_ble_sidewalk_ctx.adv_set);
            if (err != SID_ERROR_NONE)
            {
                /* Logs provided by sid_stm32wba_ble_adapter_prv_generic_start_advertisement */
                break;
            }

            /* Indicate that we are advertising */
            sid_ble_sidewalk_ctx.advertising_state = BADVS_ADVERTISEMENT_SLOW;

            SID_PAL_LOG_INFO("Sidewalk BLE advertisement switched to slow mode");
        }
        else
        {
            /* No more advertisements - final timeout */
            sid_ble_sidewalk_ctx.advertising_state = BADVS_ADVERTISEMENT_OFF;
            SID_PAL_LOG_INFO("Sidewalk BLE advertisement terminated due to timeout");
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

