stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_sidewalk_on_ble_connected(sid_pal_ble_prv_connection_ctx_t * const conn_ctx)
{
    sid_error_t err;
    tBleStatus ble_status;

    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks != NULL);
    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks->conn_callback != NULL);
    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks->mtu_callback != NULL);

    do
    {
        sid_pal_enter_critical_region();

        /* Store connection context pointer */
        sid_ble_sidewalk_ctx.conn_ctx = conn_ctx;

        /* Set the MTU limit specific to the Sidewalk link */
        sid_ble_sidewalk_ctx.conn_ctx->public_ctx.max_mtu_size = sid_ble_drv_ctx.cfg->sidewalk_profile.max_att_mtu;

        /* Update logical statuses */
        sid_ble_sidewalk_ctx.advertising_state = BADVS_ADVERTISEMENT_OFF;

        /* Notify Sidewalk stack about the established connection */
        sid_ble_sidewalk_ctx.event_callbacks->conn_callback(TRUE, sid_ble_sidewalk_ctx.conn_ctx->public_ctx.peer_identity);

        /* Set initial MTU in the Sidewalk stack */
        sid_ble_sidewalk_ctx.event_callbacks->mtu_callback(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.mtu_size);

        sid_pal_exit_critical_region();

#if SID_STM32_BLE_GATT_EXCHANGE_CONFIG_SUPPORTED
        /* Exchange peripheral config to negotiate Sidewalk-specific MTU size */
        ble_status = aci_gatt_exchange_config(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("aci_gatt_exchange_config - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> aci_gatt_exchange_config - Success");
#else
        /* This command is not supported by the peripheral-only version of the stack */
#endif /* SID_STM32_BLE_GATT_EXCHANGE_CONFIG_SUPPORTED */

        /* Update connection parameters */
        err = sid_stm32wba_ble_adapter_sidewalk_on_ble_conn_params_changed();
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Enable data length extensions (DLE) for Sidewalk link */
        ble_status = hci_le_set_data_length(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id, SID_STM32_BLE_DLE_MAX_TX_OCTETS, SID_STM32_BLE_DLE_MAX_TX_TIME_US);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("hci_le_set_data_length - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> hci_le_set_data_length - Success");

        /* Request switch to 2Mbit PHY (if supported by the peer) */
        ble_status = hci_le_set_phy(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id, 0x00, HCI_TX_PHYS_LE_2M_PREF, HCI_RX_PHYS_LE_2M_PREF, 0x00u);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_SIDEWALK_LOG_ERROR("hci_le_set_default_phy - fail, result: 0x%02X", ble_status);
        }
        SID_BLE_SIDEWALK_LOG_DEBUG("==>> hci_le_set_default_phy - Success");

        /* Done */
        SID_PAL_LOG_INFO("Sidewalk BLE connection established (0x%04X)", sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id);
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void sid_stm32wba_ble_adapter_sidewalk_on_ble_disconnected(const uint8_t reason)
{
    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks != NULL);
    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks->conn_callback != NULL);

    sid_pal_enter_critical_region();

    /* Notify Sidewalk stack about the disconnection */
    sid_ble_sidewalk_ctx.event_callbacks->conn_callback(FALSE, sid_ble_sidewalk_ctx.conn_ctx->public_ctx.peer_identity);

    /* Invalidate context */
    sid_ble_sidewalk_ctx.conn_ctx = NULL;

    sid_pal_exit_critical_region();

    SID_PAL_LOG_INFO("Sidewalk BLE connection terminated with reason 0x%02X", reason);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void sid_stm32wba_ble_adapter_sidewalk_on_ble_mtu_changed(void)
{
    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks != NULL);
    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.event_callbacks->mtu_callback != NULL);

    /* Notify Sidewalk stack about the MTU change */
    sid_ble_sidewalk_ctx.event_callbacks->mtu_callback(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.mtu_size);

    SID_PAL_LOG_INFO("Sidewalk BLE MTU changed to %u bytes", sid_ble_sidewalk_ctx.conn_ctx->public_ctx.mtu_size);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_sidewalk_on_ble_conn_params_update_req(const sid_ble_ext_proposed_conn_params_t * const proposed_params,
                                                                                                      sid_ble_ext_accepted_conn_params_t * const out_accepted_params, tBleStatus * const out_le_resp_code)
{
    sid_error_t err;

    do
    {
        err = sid_stm32wba_ble_adapter_util_validate_proposed_conn_params(proposed_params, &sidewalk_conn_limits, out_accepted_params, out_le_resp_code);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_sidewalk_on_ble_conn_params_changed(void)
{
    sid_error_t err;
    tBleStatus  ble_status;
    uint32_t    conn_params_ok;
    uint16_t    req_conn_interval_min;
    uint16_t    req_conn_interval_max;
    uint16_t    req_conn_latency;
    uint16_t    req_conn_timeout;

    static uint32_t unacceptable_params_counter = 0u;

    SID_PAL_ASSERT(sid_ble_sidewalk_ctx.conn_ctx != NULL);

