stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.c
    /* Use new connection parameters as defaults for possible connection update request */
    sid_ble_ext_proposed_conn_params_t proposed_params = {
        .interval_min = sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_interval,
        .interval_max = sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_interval,
        .latency_max  = sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_latency,
        .timeout      = sid_ble_sidewalk_ctx.conn_ctx->public_ctx.supervision_timeout,
    };

    /* Storage for the negotiated connection parameters */
    sid_ble_ext_accepted_conn_params_t accepted_params;

    do
    {
        /* Validate new connection parameters */
        err = sid_stm32wba_ble_adapter_util_validate_proposed_conn_params(&proposed_params, &sidewalk_conn_limits, &accepted_params, &ble_status);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        if (ble_status != BLE_STATUS_SUCCESS)
        {
            /* New parameters are unacceptable at all */
            SID_BLE_SIDEWALK_LOG_WARNING("Unacceptable Sidewalk BLE connection parameters - requesting parameter update");

            conn_params_ok        = FALSE;
            req_conn_interval_min = sid_ble_sidewalk_ctx.ble_cfg->conn_param.min_conn_interval;
            req_conn_interval_max = sid_ble_sidewalk_ctx.ble_cfg->conn_param.max_conn_interval;
            req_conn_latency      = sid_ble_sidewalk_ctx.ble_cfg->conn_param.slave_latency;
            req_conn_timeout      = sid_ble_sidewalk_ctx.ble_cfg->conn_param.conn_sup_timeout;
        }
        else
        {
            if ((proposed_params.timeout != accepted_params.timeout) || (proposed_params.interval_min != accepted_params.interval_min)
             || (proposed_params.interval_max != accepted_params.interval_max) || (proposed_params.latency_max != accepted_params.latency_max))
            {
                /* New connection parameters are generally ok, but some adjustments are required */
                SID_BLE_SIDEWALK_LOG_DEBUG("Suboptimal Sidewalk BLE connection parameters - requesting parameter update");

                conn_params_ok         = FALSE;
                req_conn_interval_min = accepted_params.interval_min;
                req_conn_interval_max = accepted_params.interval_max;
                req_conn_latency      = accepted_params.latency_max;
                req_conn_timeout      = accepted_params.timeout;
            }
            else
            {
                /* We are fine with the update params */
                conn_params_ok = TRUE;
            }
        }

        if (FALSE == conn_params_ok)
        {

            /* Check how many times in a row we got unacceptable params - terminate the connection if we are stuck in a parameter update loop */
            unacceptable_params_counter++;
            if (unacceptable_params_counter > SID_BLE_UNACCEPTABLE_CONN_PARAMS_UPDATE_LIMIT)
            {
                /* Limit reached, we were provided with unacceptable connection params too many times in a row */
                SID_PAL_LOG_ERROR("BLE central enforces unacceptable conn params for Sidewalk link - terminating the connection");
                unacceptable_params_counter = 0u;
                err = SID_ERROR_INCOMPATIBLE_PARAMS;
                break;
            }

            ble_status = aci_l2cap_connection_parameter_update_req(sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id,
                                                                   req_conn_interval_min,
                                                                   req_conn_interval_max,
                                                                   req_conn_latency,
                                                                   req_conn_timeout);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                SID_BLE_SIDEWALK_LOG_ERROR("aci_l2cap_connection_parameter_update_req - fail, result: 0x%02X", ble_status);
                err = SID_ERROR_IO_ERROR;
                break;
            }
            SID_BLE_SIDEWALK_LOG_DEBUG("==>> aci_l2cap_connection_parameter_update_req - Success");
        }
        else
        {
            /* Parameters are within an acceptable range, reset the counter */
            unacceptable_params_counter = 0u;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}
